Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0xf1f (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0xad480): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0xcf580): ../Core/Src/freertos.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x4e154): /home/c/STM32CubeIDE/workspace_1.12.1/PK_FZ/second/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 4
    <2b>   DW_AT_encoding    : 5	(signed)
    <2c>   DW_AT_name        : int
 <1><30>: Abbrev Number: 3 (DW_TAG_base_type)
    <31>   DW_AT_byte_size   : 4
    <32>   DW_AT_encoding    : 7	(unsigned)
    <33>   DW_AT_name        : (indirect string, offset: 0x115bb): unsigned int
 <1><37>: Abbrev Number: 3 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 8
    <39>   DW_AT_encoding    : 5	(signed)
    <3a>   DW_AT_name        : (indirect string, offset: 0x5f135): long long int
 <1><3e>: Abbrev Number: 3 (DW_TAG_base_type)

    <67>   DW_AT_name        : (indirect string, offset: 0xab859): __uint16_t
    <6b>   DW_AT_decl_file   : 2
    <6c>   DW_AT_decl_line   : 57
    <6d>   DW_AT_decl_column : 25
    <6e>   DW_AT_type        : <0x72>
 <1><72>: Abbrev Number: 3 (DW_TAG_base_type)
    <73>   DW_AT_byte_size   : 2
    <74>   DW_AT_encoding    : 7	(unsigned)
    <75>   DW_AT_name        : (indirect string, offset: 0xc91b5): short unsigned int
 <1><79>: Abbrev Number: 3 (DW_TAG_base_type)
    <7a>   DW_AT_byte_size   : 4
    <7b>   DW_AT_encoding    : 5	(signed)
    <7c>   DW_AT_name        : (indirect string, offset: 0x1202e): long int
 <1><80>: Abbrev Number: 4 (DW_TAG_typedef)
    <81>   DW_AT_name        : (indirect string, offset: 0x85758): __uint32_t
    <85>   DW_AT_decl_file   : 2
    <86>   DW_AT_decl_line   : 79
    <87>   DW_AT_decl_column : 25
    <88>   DW_AT_type        : <0x8c>
 <1><8c>: Abbrev Number: 3 (DW_TAG_base_type)
    <8d>   DW_AT_byte_size   : 4
    <8e>   DW_AT_encoding    : 7	(unsigned)
    <8f>   DW_AT_name        : (indirect string, offset: 0x4fb23): long unsigned int
 <1><93>: Abbrev Number: 3 (DW_TAG_base_type)
    <94>   DW_AT_byte_size   : 8
    <95>   DW_AT_encoding    : 7	(unsigned)
    <96>   DW_AT_name        : (indirect string, offset: 0x2ba8f): long long unsigned int
 <1><9a>: Abbrev Number: 4 (DW_TAG_typedef)
    <9b>   DW_AT_name        : (indirect string, offset: 0x3ceb3): uint8_t
    <9f>   DW_AT_decl_file   : 3
    <a0>   DW_AT_decl_line   : 24
    <a1>   DW_AT_decl_column : 19
    <a2>   DW_AT_type        : <0x4c>
 <1><a6>: Abbrev Number: 5 (DW_TAG_const_type)
    <a7>   DW_AT_type        : <0x9a>
 <1><ab>: Abbrev Number: 4 (DW_TAG_typedef)
    <ac>   DW_AT_name        : (indirect string, offset: 0x9916a): uint16_t
    <b0>   DW_AT_decl_file   : 3
    <b1>   DW_AT_decl_line   : 36
    <b2>   DW_AT_decl_column : 20
    <b3>   DW_AT_type        : <0x66>
 <1><b7>: Abbrev Number: 4 (DW_TAG_typedef)
    <b8>   DW_AT_name        : (indirect string, offset: 0x9889f): uint32_t
    <bc>   DW_AT_decl_file   : 3
    <bd>   DW_AT_decl_line   : 48
    <be>   DW_AT_decl_column : 20
    <bf>   DW_AT_type        : <0x80>
 <1><c3>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <c4>   DW_AT_type        : <0xb7>
 <1><c8>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <c9>   DW_AT_byte_size   : 4
 <1><ca>: Abbrev Number: 5 (DW_TAG_const_type)
    <cb>   DW_AT_type        : <0xc8>
 <1><cf>: Abbrev Number: 4 (DW_TAG_typedef)
    <d0>   DW_AT_name        : (indirect string, offset: 0x99694): StackType_t
    <d4>   DW_AT_decl_file   : 4
    <d5>   DW_AT_decl_line   : 55
    <d6>   DW_AT_decl_column : 24
    <d7>   DW_AT_type        : <0xb7>
 <1><db>: Abbrev Number: 4 (DW_TAG_typedef)
    <dc>   DW_AT_name        : (indirect string, offset: 0x1a04): BaseType_t
    <e0>   DW_AT_decl_file   : 4
    <e1>   DW_AT_decl_line   : 56
    <e2>   DW_AT_decl_column : 14
    <e3>   DW_AT_type        : <0x79>
 <1><e7>: Abbrev Number: 4 (DW_TAG_typedef)
    <e8>   DW_AT_name        : (indirect string, offset: 0x1a03): UBaseType_t
    <ec>   DW_AT_decl_file   : 4
    <ed>   DW_AT_decl_line   : 57
    <ee>   DW_AT_decl_column : 23
    <ef>   DW_AT_type        : <0x8c>
 <1><f3>: Abbrev Number: 5 (DW_TAG_const_type)
    <f4>   DW_AT_type        : <0xe7>
 <1><f8>: Abbrev Number: 4 (DW_TAG_typedef)
    <f9>   DW_AT_name        : (indirect string, offset: 0x2d887): TickType_t
    <fd>   DW_AT_decl_file   : 4
    <fe>   DW_AT_decl_line   : 63
    <ff>   DW_AT_decl_column : 19
    <100>   DW_AT_type        : <0xb7>
 <1><104>: Abbrev Number: 5 (DW_TAG_const_type)
    <105>   DW_AT_type        : <0xf8>
 <1><109>: Abbrev Number: 8 (DW_TAG_typedef)
    <10a>   DW_AT_name        : (indirect string, offset: 0x9abe4): wint_t
    <10e>   DW_AT_decl_file   : 5
    <10f>   DW_AT_decl_line   : 350
    <111>   DW_AT_decl_column : 23
    <112>   DW_AT_type        : <0x30>
 <1><116>: Abbrev Number: 4 (DW_TAG_typedef)
    <117>   DW_AT_name        : (indirect string, offset: 0xbe3f5): _off_t
    <11b>   DW_AT_decl_file   : 6
    <11c>   DW_AT_decl_line   : 46
    <11d>   DW_AT_decl_column : 14
    <11e>   DW_AT_type        : <0x79>
 <1><122>: Abbrev Number: 4 (DW_TAG_typedef)
    <123>   DW_AT_name        : (indirect string, offset: 0x2e806): _fpos_t
    <127>   DW_AT_decl_file   : 6
    <128>   DW_AT_decl_line   : 116
    <129>   DW_AT_decl_column : 14
    <12a>   DW_AT_type        : <0x79>
 <1><12e>: Abbrev Number: 9 (DW_TAG_union_type)
    <12f>   DW_AT_byte_size   : 4
    <130>   DW_AT_decl_file   : 6
    <131>   DW_AT_decl_line   : 165
    <132>   DW_AT_decl_column : 3
    <133>   DW_AT_sibling     : <0x150>
 <2><137>: Abbrev Number: 10 (DW_TAG_member)
    <138>   DW_AT_name        : (indirect string, offset: 0xa102b): __wch
    <13c>   DW_AT_decl_file   : 6
    <13d>   DW_AT_decl_line   : 167
    <13e>   DW_AT_decl_column : 12
    <13f>   DW_AT_type        : <0x109>
 <2><143>: Abbrev Number: 10 (DW_TAG_member)
    <144>   DW_AT_name        : (indirect string, offset: 0x6b4d2): __wchb
    <148>   DW_AT_decl_file   : 6
    <149>   DW_AT_decl_line   : 168
    <14a>   DW_AT_decl_column : 19
    <14b>   DW_AT_type        : <0x150>
 <2><14f>: Abbrev Number: 0
 <1><150>: Abbrev Number: 11 (DW_TAG_array_type)
    <151>   DW_AT_type        : <0x58>
    <155>   DW_AT_sibling     : <0x160>
 <2><159>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <15a>   DW_AT_type        : <0x30>
    <15e>   DW_AT_upper_bound : 3
 <2><15f>: Abbrev Number: 0
 <1><160>: Abbrev Number: 13 (DW_TAG_structure_type)
    <161>   DW_AT_byte_size   : 8
    <162>   DW_AT_decl_file   : 6
    <163>   DW_AT_decl_line   : 162
    <164>   DW_AT_decl_column : 9
    <165>   DW_AT_sibling     : <0x184>
 <2><169>: Abbrev Number: 14 (DW_TAG_member)
    <16a>   DW_AT_name        : (indirect string, offset: 0x3af9f): __count
    <16e>   DW_AT_decl_file   : 6
    <16f>   DW_AT_decl_line   : 164
    <170>   DW_AT_decl_column : 7
    <171>   DW_AT_type        : <0x29>
    <175>   DW_AT_data_member_location: 0
 <2><176>: Abbrev Number: 14 (DW_TAG_member)
    <177>   DW_AT_name        : (indirect string, offset: 0x77544): __value
    <17b>   DW_AT_decl_file   : 6
    <17c>   DW_AT_decl_line   : 169
    <17d>   DW_AT_decl_column : 5
    <17e>   DW_AT_type        : <0x12e>
    <182>   DW_AT_data_member_location: 4
 <2><183>: Abbrev Number: 0
 <1><184>: Abbrev Number: 4 (DW_TAG_typedef)
    <185>   DW_AT_name        : (indirect string, offset: 0x6d06d): _mbstate_t
    <189>   DW_AT_decl_file   : 6
    <18a>   DW_AT_decl_line   : 170
    <18b>   DW_AT_decl_column : 3
    <18c>   DW_AT_type        : <0x160>
 <1><190>: Abbrev Number: 4 (DW_TAG_typedef)
    <191>   DW_AT_name        : (indirect string, offset: 0x70d6a): __ULong
    <195>   DW_AT_decl_file   : 7
    <196>   DW_AT_decl_line   : 22
    <197>   DW_AT_decl_column : 25
    <198>   DW_AT_type        : <0x8c>
 <1><19c>: Abbrev Number: 4 (DW_TAG_typedef)
    <19d>   DW_AT_name        : (indirect string, offset: 0x72682): _LOCK_T
    <1a1>   DW_AT_decl_file   : 8
    <1a2>   DW_AT_decl_line   : 34
    <1a3>   DW_AT_decl_column : 25
    <1a4>   DW_AT_type        : <0x1a8>
 <1><1a8>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <1a9>   DW_AT_byte_size   : 4
    <1aa>   DW_AT_type        : <0x1ae>
 <1><1ae>: Abbrev Number: 16 (DW_TAG_structure_type)
    <1af>   DW_AT_name        : (indirect string, offset: 0x1b15f): __lock
    <1b3>   DW_AT_declaration : 1
 <1><1b3>: Abbrev Number: 4 (DW_TAG_typedef)
    <1b4>   DW_AT_name        : (indirect string, offset: 0x66b5a): _flock_t
    <1b8>   DW_AT_decl_file   : 7
    <1b9>   DW_AT_decl_line   : 35
    <1ba>   DW_AT_decl_column : 27
    <1bb>   DW_AT_type        : <0x19c>
 <1><1bf>: Abbrev Number: 17 (DW_TAG_structure_type)
    <1c0>   DW_AT_name        : (indirect string, offset: 0x48d5b): _Bigint
    <1c4>   DW_AT_byte_size   : 24
    <1c5>   DW_AT_decl_file   : 7
    <1c6>   DW_AT_decl_line   : 52
    <1c7>   DW_AT_decl_column : 8
    <1c8>   DW_AT_sibling     : <0x219>
 <2><1cc>: Abbrev Number: 14 (DW_TAG_member)
    <1cd>   DW_AT_name        : (indirect string, offset: 0x7c493): _next
    <1d1>   DW_AT_decl_file   : 7
    <1d2>   DW_AT_decl_line   : 54
    <1d3>   DW_AT_decl_column : 19
    <1d4>   DW_AT_type        : <0x219>
    <1d8>   DW_AT_data_member_location: 0
 <2><1d9>: Abbrev Number: 18 (DW_TAG_member)
    <1da>   DW_AT_name        : _k
    <1dd>   DW_AT_decl_file   : 7
    <1de>   DW_AT_decl_line   : 55
    <1df>   DW_AT_decl_column : 7
    <1e0>   DW_AT_type        : <0x29>
    <1e4>   DW_AT_data_member_location: 4
 <2><1e5>: Abbrev Number: 14 (DW_TAG_member)
    <1e6>   DW_AT_name        : (indirect string, offset: 0x9612e): _maxwds
    <1ea>   DW_AT_decl_file   : 7
    <1eb>   DW_AT_decl_line   : 55
    <1ec>   DW_AT_decl_column : 11
    <1ed>   DW_AT_type        : <0x29>
    <1f1>   DW_AT_data_member_location: 8
 <2><1f2>: Abbrev Number: 14 (DW_TAG_member)
    <1f3>   DW_AT_name        : (indirect string, offset: 0x6edd3): _sign
    <1f7>   DW_AT_decl_file   : 7
    <1f8>   DW_AT_decl_line   : 55
    <1f9>   DW_AT_decl_column : 20
    <1fa>   DW_AT_type        : <0x29>
    <1fe>   DW_AT_data_member_location: 12
 <2><1ff>: Abbrev Number: 14 (DW_TAG_member)
    <200>   DW_AT_name        : (indirect string, offset: 0x6e823): _wds
    <204>   DW_AT_decl_file   : 7
    <205>   DW_AT_decl_line   : 55
    <206>   DW_AT_decl_column : 27
    <207>   DW_AT_type        : <0x29>
    <20b>   DW_AT_data_member_location: 16
 <2><20c>: Abbrev Number: 18 (DW_TAG_member)
    <20d>   DW_AT_name        : _x
    <210>   DW_AT_decl_file   : 7
    <211>   DW_AT_decl_line   : 56
    <212>   DW_AT_decl_column : 11
    <213>   DW_AT_type        : <0x21f>
    <217>   DW_AT_data_member_location: 20
 <2><218>: Abbrev Number: 0
 <1><219>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <21a>   DW_AT_byte_size   : 4
    <21b>   DW_AT_type        : <0x1bf>
 <1><21f>: Abbrev Number: 11 (DW_TAG_array_type)
    <220>   DW_AT_type        : <0x190>
    <224>   DW_AT_sibling     : <0x22f>
 <2><228>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <229>   DW_AT_type        : <0x30>
    <22d>   DW_AT_upper_bound : 0
 <2><22e>: Abbrev Number: 0
 <1><22f>: Abbrev Number: 17 (DW_TAG_structure_type)
    <230>   DW_AT_name        : (indirect string, offset: 0x395ca): __tm
    <234>   DW_AT_byte_size   : 36
    <235>   DW_AT_decl_file   : 7
    <236>   DW_AT_decl_line   : 60
    <237>   DW_AT_decl_column : 8
    <238>   DW_AT_sibling     : <0x2b2>
 <2><23c>: Abbrev Number: 14 (DW_TAG_member)
    <23d>   DW_AT_name        : (indirect string, offset: 0xabf8c): __tm_sec
    <241>   DW_AT_decl_file   : 7
    <242>   DW_AT_decl_line   : 62
    <243>   DW_AT_decl_column : 9
    <244>   DW_AT_type        : <0x29>
    <248>   DW_AT_data_member_location: 0
 <2><249>: Abbrev Number: 14 (DW_TAG_member)
    <24a>   DW_AT_name        : (indirect string, offset: 0xfdb): __tm_min
    <24e>   DW_AT_decl_file   : 7
    <24f>   DW_AT_decl_line   : 63
    <250>   DW_AT_decl_column : 9
    <251>   DW_AT_type        : <0x29>
    <255>   DW_AT_data_member_location: 4
 <2><256>: Abbrev Number: 14 (DW_TAG_member)
    <257>   DW_AT_name        : (indirect string, offset: 0x2cb24): __tm_hour
    <25b>   DW_AT_decl_file   : 7
    <25c>   DW_AT_decl_line   : 64
    <25d>   DW_AT_decl_column : 9
    <25e>   DW_AT_type        : <0x29>
    <262>   DW_AT_data_member_location: 8
 <2><263>: Abbrev Number: 14 (DW_TAG_member)
    <264>   DW_AT_name        : (indirect string, offset: 0x7a34c): __tm_mday
    <268>   DW_AT_decl_file   : 7
    <269>   DW_AT_decl_line   : 65
    <26a>   DW_AT_decl_column : 9
    <26b>   DW_AT_type        : <0x29>
    <26f>   DW_AT_data_member_location: 12
 <2><270>: Abbrev Number: 14 (DW_TAG_member)
    <271>   DW_AT_name        : (indirect string, offset: 0x9bae5): __tm_mon
    <275>   DW_AT_decl_file   : 7
    <276>   DW_AT_decl_line   : 66
    <277>   DW_AT_decl_column : 9
    <278>   DW_AT_type        : <0x29>
    <27c>   DW_AT_data_member_location: 16
 <2><27d>: Abbrev Number: 14 (DW_TAG_member)
    <27e>   DW_AT_name        : (indirect string, offset: 0xc3216): __tm_year
    <282>   DW_AT_decl_file   : 7
    <283>   DW_AT_decl_line   : 67
    <284>   DW_AT_decl_column : 9
    <285>   DW_AT_type        : <0x29>
    <289>   DW_AT_data_member_location: 20
 <2><28a>: Abbrev Number: 14 (DW_TAG_member)
    <28b>   DW_AT_name        : (indirect string, offset: 0x57efa): __tm_wday
    <28f>   DW_AT_decl_file   : 7
    <290>   DW_AT_decl_line   : 68
    <291>   DW_AT_decl_column : 9
    <292>   DW_AT_type        : <0x29>
    <296>   DW_AT_data_member_location: 24
 <2><297>: Abbrev Number: 14 (DW_TAG_member)
    <298>   DW_AT_name        : (indirect string, offset: 0xa65b6): __tm_yday
    <29c>   DW_AT_decl_file   : 7
    <29d>   DW_AT_decl_line   : 69
    <29e>   DW_AT_decl_column : 9
    <29f>   DW_AT_type        : <0x29>
    <2a3>   DW_AT_data_member_location: 28
 <2><2a4>: Abbrev Number: 14 (DW_TAG_member)
    <2a5>   DW_AT_name        : (indirect string, offset: 0xbc9cd): __tm_isdst
    <2a9>   DW_AT_decl_file   : 7
    <2aa>   DW_AT_decl_line   : 70
    <2ab>   DW_AT_decl_column : 9
    <2ac>   DW_AT_type        : <0x29>
    <2b0>   DW_AT_data_member_location: 32
 <2><2b1>: Abbrev Number: 0
 <1><2b2>: Abbrev Number: 17 (DW_TAG_structure_type)
    <2b3>   DW_AT_name        : (indirect string, offset: 0x8c148): __sbuf
    <2b7>   DW_AT_byte_size   : 8
    <2b8>   DW_AT_decl_file   : 7
    <2b9>   DW_AT_decl_line   : 122
    <2ba>   DW_AT_decl_column : 8
    <2bb>   DW_AT_sibling     : <0x2da>
 <2><2bf>: Abbrev Number: 14 (DW_TAG_member)
    <2c0>   DW_AT_name        : (indirect string, offset: 0x880fc): _base
    <2c4>   DW_AT_decl_file   : 7
    <2c5>   DW_AT_decl_line   : 123
    <2c6>   DW_AT_decl_column : 17
    <2c7>   DW_AT_type        : <0x2da>
    <2cb>   DW_AT_data_member_location: 0
 <2><2cc>: Abbrev Number: 14 (DW_TAG_member)
    <2cd>   DW_AT_name        : (indirect string, offset: 0x62f48): _size
    <2d1>   DW_AT_decl_file   : 7
    <2d2>   DW_AT_decl_line   : 124
    <2d3>   DW_AT_decl_column : 6
    <2d4>   DW_AT_type        : <0x29>
    <2d8>   DW_AT_data_member_location: 4
 <2><2d9>: Abbrev Number: 0
 <1><2da>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <2db>   DW_AT_byte_size   : 4
    <2dc>   DW_AT_type        : <0x58>
 <1><2e0>: Abbrev Number: 19 (DW_TAG_structure_type)
    <2e1>   DW_AT_name        : (indirect string, offset: 0xdda8e): _reent
    <2e5>   DW_AT_byte_size   : 96
    <2e6>   DW_AT_decl_file   : 7
    <2e7>   DW_AT_decl_line   : 377
    <2e9>   DW_AT_decl_column : 8
    <2ea>   DW_AT_sibling     : <0x423>
 <2><2ee>: Abbrev Number: 20 (DW_TAG_member)
    <2ef>   DW_AT_name        : (indirect string, offset: 0xdd5ea): _errno
    <2f3>   DW_AT_decl_file   : 7
    <2f4>   DW_AT_decl_line   : 381
    <2f6>   DW_AT_decl_column : 7
    <2f7>   DW_AT_type        : <0x29>
    <2fb>   DW_AT_data_member_location: 0
 <2><2fc>: Abbrev Number: 20 (DW_TAG_member)
    <2fd>   DW_AT_name        : (indirect string, offset: 0xdcd12): _stdin
    <301>   DW_AT_decl_file   : 7
    <302>   DW_AT_decl_line   : 386
    <304>   DW_AT_decl_column : 11
    <305>   DW_AT_type        : <0x67b>
    <309>   DW_AT_data_member_location: 4
 <2><30a>: Abbrev Number: 20 (DW_TAG_member)
    <30b>   DW_AT_name        : (indirect string, offset: 0xdd92a): _stdout
    <30f>   DW_AT_decl_file   : 7
    <310>   DW_AT_decl_line   : 386
    <312>   DW_AT_decl_column : 20
    <313>   DW_AT_type        : <0x67b>
    <317>   DW_AT_data_member_location: 8
 <2><318>: Abbrev Number: 20 (DW_TAG_member)
    <319>   DW_AT_name        : (indirect string, offset: 0xdd8d3): _stderr
    <31d>   DW_AT_decl_file   : 7
    <31e>   DW_AT_decl_line   : 386
    <320>   DW_AT_decl_column : 30
    <321>   DW_AT_type        : <0x67b>
    <325>   DW_AT_data_member_location: 12
 <2><326>: Abbrev Number: 20 (DW_TAG_member)
    <327>   DW_AT_name        : (indirect string, offset: 0x84bb3): _inc
    <32b>   DW_AT_decl_file   : 7
    <32c>   DW_AT_decl_line   : 388
    <32e>   DW_AT_decl_column : 8
    <32f>   DW_AT_type        : <0x29>
    <333>   DW_AT_data_member_location: 16
 <2><334>: Abbrev Number: 20 (DW_TAG_member)
    <335>   DW_AT_name        : (indirect string, offset: 0xa5da2): _emergency
    <339>   DW_AT_decl_file   : 7
    <33a>   DW_AT_decl_line   : 390
    <33c>   DW_AT_decl_column : 9
    <33d>   DW_AT_type        : <0x58a>
    <341>   DW_AT_data_member_location: 20
 <2><342>: Abbrev Number: 20 (DW_TAG_member)
    <343>   DW_AT_name        : (indirect string, offset: 0x5a530): __sdidinit
    <347>   DW_AT_decl_file   : 7
    <348>   DW_AT_decl_line   : 392
    <34a>   DW_AT_decl_column : 7
    <34b>   DW_AT_type        : <0x29>
    <34f>   DW_AT_data_member_location: 24
 <2><350>: Abbrev Number: 20 (DW_TAG_member)
    <351>   DW_AT_name        : (indirect string, offset: 0x13101): _unspecified_locale_info
    <355>   DW_AT_decl_file   : 7
    <356>   DW_AT_decl_line   : 394
    <358>   DW_AT_decl_column : 7
    <359>   DW_AT_type        : <0x29>
    <35d>   DW_AT_data_member_location: 28
 <2><35e>: Abbrev Number: 20 (DW_TAG_member)
    <35f>   DW_AT_name        : (indirect string, offset: 0xb9f32): _locale
    <363>   DW_AT_decl_file   : 7
    <364>   DW_AT_decl_line   : 395
    <366>   DW_AT_decl_column : 22
    <367>   DW_AT_type        : <0x7e3>
    <36b>   DW_AT_data_member_location: 32
 <2><36c>: Abbrev Number: 21 (DW_TAG_member)
    <36d>   DW_AT_name        : _mp
    <371>   DW_AT_decl_file   : 7
    <372>   DW_AT_decl_line   : 397
    <374>   DW_AT_decl_column : 18
    <375>   DW_AT_type        : <0x7e9>
    <379>   DW_AT_data_member_location: 36
 <2><37a>: Abbrev Number: 20 (DW_TAG_member)
    <37b>   DW_AT_name        : (indirect string, offset: 0x20b60): __cleanup
    <37f>   DW_AT_decl_file   : 7
    <380>   DW_AT_decl_line   : 399
    <382>   DW_AT_decl_column : 10
    <383>   DW_AT_type        : <0x7fa>
    <387>   DW_AT_data_member_location: 40
 <2><388>: Abbrev Number: 20 (DW_TAG_member)
    <389>   DW_AT_name        : (indirect string, offset: 0x349c9): _gamma_signgam
    <38d>   DW_AT_decl_file   : 7
    <38e>   DW_AT_decl_line   : 401
    <390>   DW_AT_decl_column : 7
    <391>   DW_AT_type        : <0x29>
    <395>   DW_AT_data_member_location: 44
 <2><396>: Abbrev Number: 20 (DW_TAG_member)
    <397>   DW_AT_name        : (indirect string, offset: 0x9a87f): _cvtlen
    <39b>   DW_AT_decl_file   : 7
    <39c>   DW_AT_decl_line   : 404
    <39e>   DW_AT_decl_column : 7
    <39f>   DW_AT_type        : <0x29>
    <3a3>   DW_AT_data_member_location: 48
 <2><3a4>: Abbrev Number: 20 (DW_TAG_member)
    <3a5>   DW_AT_name        : (indirect string, offset: 0x60455): _cvtbuf
    <3a9>   DW_AT_decl_file   : 7
    <3aa>   DW_AT_decl_line   : 405
    <3ac>   DW_AT_decl_column : 9
    <3ad>   DW_AT_type        : <0x58a>
    <3b1>   DW_AT_data_member_location: 52
 <2><3b2>: Abbrev Number: 20 (DW_TAG_member)
    <3b3>   DW_AT_name        : (indirect string, offset: 0x9d09c): _r48
    <3b7>   DW_AT_decl_file   : 7
    <3b8>   DW_AT_decl_line   : 407
    <3ba>   DW_AT_decl_column : 19
    <3bb>   DW_AT_type        : <0x800>
    <3bf>   DW_AT_data_member_location: 56
 <2><3c0>: Abbrev Number: 20 (DW_TAG_member)
    <3c1>   DW_AT_name        : (indirect string, offset: 0xae6b2): _localtime_buf
    <3c5>   DW_AT_decl_file   : 7
    <3c6>   DW_AT_decl_line   : 408
    <3c8>   DW_AT_decl_column : 16
    <3c9>   DW_AT_type        : <0x806>
    <3cd>   DW_AT_data_member_location: 60
 <2><3ce>: Abbrev Number: 20 (DW_TAG_member)
    <3cf>   DW_AT_name        : (indirect string, offset: 0x31b60): _asctime_buf
    <3d3>   DW_AT_decl_file   : 7
    <3d4>   DW_AT_decl_line   : 409
    <3d6>   DW_AT_decl_column : 9
    <3d7>   DW_AT_type        : <0x58a>
    <3db>   DW_AT_data_member_location: 64
 <2><3dc>: Abbrev Number: 20 (DW_TAG_member)
    <3dd>   DW_AT_name        : (indirect string, offset: 0x2aca3): _sig_func
    <3e1>   DW_AT_decl_file   : 7
    <3e2>   DW_AT_decl_line   : 412
    <3e4>   DW_AT_decl_column : 12
    <3e5>   DW_AT_type        : <0x817>
    <3e9>   DW_AT_data_member_location: 68
 <2><3ea>: Abbrev Number: 20 (DW_TAG_member)
    <3eb>   DW_AT_name        : (indirect string, offset: 0x95fca): __sglue
    <3ef>   DW_AT_decl_file   : 7
    <3f0>   DW_AT_decl_line   : 420
    <3f2>   DW_AT_decl_column : 16
    <3f3>   DW_AT_type        : <0x63c>
    <3f7>   DW_AT_data_member_location: 72
 <2><3f8>: Abbrev Number: 20 (DW_TAG_member)
    <3f9>   DW_AT_name        : (indirect string, offset: 0x38e42): __sf
    <3fd>   DW_AT_decl_file   : 7
    <3fe>   DW_AT_decl_line   : 421
    <400>   DW_AT_decl_column : 11
    <401>   DW_AT_type        : <0x67b>
    <405>   DW_AT_data_member_location: 84
 <2><406>: Abbrev Number: 20 (DW_TAG_member)
    <407>   DW_AT_name        : (indirect string, offset: 0x5e351): _misc
    <40b>   DW_AT_decl_file   : 7
    <40c>   DW_AT_decl_line   : 422
    <40e>   DW_AT_decl_column : 23
    <40f>   DW_AT_type        : <0x823>
    <413>   DW_AT_data_member_location: 88
 <2><414>: Abbrev Number: 20 (DW_TAG_member)
    <415>   DW_AT_name        : (indirect string, offset: 0x82817): _signal_buf
    <419>   DW_AT_decl_file   : 7
    <41a>   DW_AT_decl_line   : 423
    <41c>   DW_AT_decl_column : 9
    <41d>   DW_AT_type        : <0x58a>
    <421>   DW_AT_data_member_location: 92
 <2><422>: Abbrev Number: 0
 <1><423>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <424>   DW_AT_byte_size   : 4
    <425>   DW_AT_type        : <0x2e0>
 <1><429>: Abbrev Number: 17 (DW_TAG_structure_type)
    <42a>   DW_AT_name        : (indirect string, offset: 0xa0c8a): __sFILE
    <42e>   DW_AT_byte_size   : 104
    <42f>   DW_AT_decl_file   : 7
    <430>   DW_AT_decl_line   : 186
    <431>   DW_AT_decl_column : 8
    <432>   DW_AT_sibling     : <0x56c>
 <2><436>: Abbrev Number: 18 (DW_TAG_member)
    <437>   DW_AT_name        : _p
    <43a>   DW_AT_decl_file   : 7
    <43b>   DW_AT_decl_line   : 187
    <43c>   DW_AT_decl_column : 18
    <43d>   DW_AT_type        : <0x2da>
    <441>   DW_AT_data_member_location: 0
 <2><442>: Abbrev Number: 18 (DW_TAG_member)
    <443>   DW_AT_name        : _r
    <446>   DW_AT_decl_file   : 7
    <447>   DW_AT_decl_line   : 188
    <448>   DW_AT_decl_column : 7
    <449>   DW_AT_type        : <0x29>
    <44d>   DW_AT_data_member_location: 4
 <2><44e>: Abbrev Number: 18 (DW_TAG_member)
    <44f>   DW_AT_name        : _w
    <452>   DW_AT_decl_file   : 7
    <453>   DW_AT_decl_line   : 189
    <454>   DW_AT_decl_column : 7
    <455>   DW_AT_type        : <0x29>
    <459>   DW_AT_data_member_location: 8
 <2><45a>: Abbrev Number: 14 (DW_TAG_member)
    <45b>   DW_AT_name        : (indirect string, offset: 0x5f1ef): _flags
    <45f>   DW_AT_decl_file   : 7
    <460>   DW_AT_decl_line   : 190
    <461>   DW_AT_decl_column : 9
    <462>   DW_AT_type        : <0x5f>
    <466>   DW_AT_data_member_location: 12
 <2><467>: Abbrev Number: 14 (DW_TAG_member)
    <468>   DW_AT_name        : (indirect string, offset: 0x20081): _file
    <46c>   DW_AT_decl_file   : 7
    <46d>   DW_AT_decl_line   : 191
    <46e>   DW_AT_decl_column : 9
    <46f>   DW_AT_type        : <0x5f>
    <473>   DW_AT_data_member_location: 14
 <2><474>: Abbrev Number: 18 (DW_TAG_member)
    <475>   DW_AT_name        : _bf
    <479>   DW_AT_decl_file   : 7
    <47a>   DW_AT_decl_line   : 192
    <47b>   DW_AT_decl_column : 17
    <47c>   DW_AT_type        : <0x2b2>
    <480>   DW_AT_data_member_location: 16
 <2><481>: Abbrev Number: 14 (DW_TAG_member)
    <482>   DW_AT_name        : (indirect string, offset: 0x5f7f9): _lbfsize
    <486>   DW_AT_decl_file   : 7
    <487>   DW_AT_decl_line   : 193
    <488>   DW_AT_decl_column : 7
    <489>   DW_AT_type        : <0x29>
    <48d>   DW_AT_data_member_location: 24
 <2><48e>: Abbrev Number: 14 (DW_TAG_member)
    <48f>   DW_AT_name        : (indirect string, offset: 0xd7ba8): _data
    <493>   DW_AT_decl_file   : 7
    <494>   DW_AT_decl_line   : 196
    <495>   DW_AT_decl_column : 18
    <496>   DW_AT_type        : <0x423>
    <49a>   DW_AT_data_member_location: 28
 <2><49b>: Abbrev Number: 14 (DW_TAG_member)
    <49c>   DW_AT_name        : (indirect string, offset: 0xbb003): _cookie
    <4a0>   DW_AT_decl_file   : 7
    <4a1>   DW_AT_decl_line   : 200
    <4a2>   DW_AT_decl_column : 10
    <4a3>   DW_AT_type        : <0xc8>
    <4a7>   DW_AT_data_member_location: 32
 <2><4a8>: Abbrev Number: 14 (DW_TAG_member)
    <4a9>   DW_AT_name        : (indirect string, offset: 0xa5a01): _read
    <4ad>   DW_AT_decl_file   : 7
    <4ae>   DW_AT_decl_line   : 202
    <4af>   DW_AT_decl_column : 29
    <4b0>   DW_AT_type        : <0x59c>
    <4b4>   DW_AT_data_member_location: 36
 <2><4b5>: Abbrev Number: 14 (DW_TAG_member)
    <4b6>   DW_AT_name        : (indirect string, offset: 0x1b1a2): _write
    <4ba>   DW_AT_decl_file   : 7
    <4bb>   DW_AT_decl_line   : 204
    <4bc>   DW_AT_decl_column : 29
    <4bd>   DW_AT_type        : <0x5cb>
    <4c1>   DW_AT_data_member_location: 40
 <2><4c2>: Abbrev Number: 14 (DW_TAG_member)
    <4c3>   DW_AT_name        : (indirect string, offset: 0xce187): _seek
    <4c7>   DW_AT_decl_file   : 7
    <4c8>   DW_AT_decl_line   : 207
    <4c9>   DW_AT_decl_column : 13
    <4ca>   DW_AT_type        : <0x5ef>
    <4ce>   DW_AT_data_member_location: 44
 <2><4cf>: Abbrev Number: 14 (DW_TAG_member)
    <4d0>   DW_AT_name        : (indirect string, offset: 0xd694f): _close
    <4d4>   DW_AT_decl_file   : 7
    <4d5>   DW_AT_decl_line   : 208
    <4d6>   DW_AT_decl_column : 9
    <4d7>   DW_AT_type        : <0x609>
    <4db>   DW_AT_data_member_location: 48
 <2><4dc>: Abbrev Number: 18 (DW_TAG_member)
    <4dd>   DW_AT_name        : _ub
    <4e1>   DW_AT_decl_file   : 7
    <4e2>   DW_AT_decl_line   : 211
    <4e3>   DW_AT_decl_column : 17
    <4e4>   DW_AT_type        : <0x2b2>
    <4e8>   DW_AT_data_member_location: 52
 <2><4e9>: Abbrev Number: 18 (DW_TAG_member)
    <4ea>   DW_AT_name        : _up
    <4ee>   DW_AT_decl_file   : 7
    <4ef>   DW_AT_decl_line   : 212
    <4f0>   DW_AT_decl_column : 18
    <4f1>   DW_AT_type        : <0x2da>
    <4f5>   DW_AT_data_member_location: 60
 <2><4f6>: Abbrev Number: 18 (DW_TAG_member)
    <4f7>   DW_AT_name        : _ur
    <4fb>   DW_AT_decl_file   : 7
    <4fc>   DW_AT_decl_line   : 213
    <4fd>   DW_AT_decl_column : 7
    <4fe>   DW_AT_type        : <0x29>
    <502>   DW_AT_data_member_location: 64
 <2><503>: Abbrev Number: 14 (DW_TAG_member)
    <504>   DW_AT_name        : (indirect string, offset: 0xcbbe5): _ubuf
    <508>   DW_AT_decl_file   : 7
    <509>   DW_AT_decl_line   : 216
    <50a>   DW_AT_decl_column : 17
    <50b>   DW_AT_type        : <0x60f>
    <50f>   DW_AT_data_member_location: 68
 <2><510>: Abbrev Number: 14 (DW_TAG_member)
    <511>   DW_AT_name        : (indirect string, offset: 0x8e7aa): _nbuf
    <515>   DW_AT_decl_file   : 7
    <516>   DW_AT_decl_line   : 217
    <517>   DW_AT_decl_column : 17
    <518>   DW_AT_type        : <0x61f>
    <51c>   DW_AT_data_member_location: 71
 <2><51d>: Abbrev Number: 18 (DW_TAG_member)
    <51e>   DW_AT_name        : _lb
    <522>   DW_AT_decl_file   : 7
    <523>   DW_AT_decl_line   : 220
    <524>   DW_AT_decl_column : 17
    <525>   DW_AT_type        : <0x2b2>
    <529>   DW_AT_data_member_location: 72
 <2><52a>: Abbrev Number: 14 (DW_TAG_member)
    <52b>   DW_AT_name        : (indirect string, offset: 0x350ca): _blksize
    <52f>   DW_AT_decl_file   : 7
    <530>   DW_AT_decl_line   : 223
    <531>   DW_AT_decl_column : 7
    <532>   DW_AT_type        : <0x29>
    <536>   DW_AT_data_member_location: 80
 <2><537>: Abbrev Number: 14 (DW_TAG_member)
    <538>   DW_AT_name        : (indirect string, offset: 0x4372e): _offset
    <53c>   DW_AT_decl_file   : 7
    <53d>   DW_AT_decl_line   : 224
    <53e>   DW_AT_decl_column : 10
    <53f>   DW_AT_type        : <0x116>
    <543>   DW_AT_data_member_location: 84
 <2><544>: Abbrev Number: 14 (DW_TAG_member)
    <545>   DW_AT_name        : (indirect string, offset: 0x1b160): _lock
    <549>   DW_AT_decl_file   : 7
    <54a>   DW_AT_decl_line   : 231
    <54b>   DW_AT_decl_column : 12
    <54c>   DW_AT_type        : <0x1b3>
    <550>   DW_AT_data_member_location: 88
 <2><551>: Abbrev Number: 14 (DW_TAG_member)
    <552>   DW_AT_name        : (indirect string, offset: 0x5af21): _mbstate
    <556>   DW_AT_decl_file   : 7
    <557>   DW_AT_decl_line   : 233
    <558>   DW_AT_decl_column : 14
    <559>   DW_AT_type        : <0x184>
    <55d>   DW_AT_data_member_location: 92
 <2><55e>: Abbrev Number: 14 (DW_TAG_member)
    <55f>   DW_AT_name        : (indirect string, offset: 0xaacd6): _flags2
    <563>   DW_AT_decl_file   : 7
    <564>   DW_AT_decl_line   : 234
    <565>   DW_AT_decl_column : 9
    <566>   DW_AT_type        : <0x29>
    <56a>   DW_AT_data_member_location: 100
 <2><56b>: Abbrev Number: 0
 <1><56c>: Abbrev Number: 22 (DW_TAG_subroutine_type)
    <56d>   DW_AT_prototyped  : 1
    <56d>   DW_AT_type        : <0x29>
    <571>   DW_AT_sibling     : <0x58a>
 <2><575>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <576>   DW_AT_type        : <0x423>
 <2><57a>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <57b>   DW_AT_type        : <0xc8>
 <2><57f>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <580>   DW_AT_type        : <0x58a>
 <2><584>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <585>   DW_AT_type        : <0x29>
 <2><589>: Abbrev Number: 0
 <1><58a>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <58b>   DW_AT_byte_size   : 4
    <58c>   DW_AT_type        : <0x590>
 <1><590>: Abbrev Number: 3 (DW_TAG_base_type)
    <591>   DW_AT_byte_size   : 1
    <592>   DW_AT_encoding    : 8	(unsigned char)
    <593>   DW_AT_name        : (indirect string, offset: 0x43bc7): char
 <1><597>: Abbrev Number: 5 (DW_TAG_const_type)
    <598>   DW_AT_type        : <0x590>
 <1><59c>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <59d>   DW_AT_byte_size   : 4
    <59e>   DW_AT_type        : <0x56c>
 <1><5a2>: Abbrev Number: 22 (DW_TAG_subroutine_type)
    <5a3>   DW_AT_prototyped  : 1
    <5a3>   DW_AT_type        : <0x29>
    <5a7>   DW_AT_sibling     : <0x5c0>
 <2><5ab>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <5ac>   DW_AT_type        : <0x423>
 <2><5b0>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <5b1>   DW_AT_type        : <0xc8>
 <2><5b5>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <5b6>   DW_AT_type        : <0x5c0>
 <2><5ba>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <5bb>   DW_AT_type        : <0x29>
 <2><5bf>: Abbrev Number: 0
 <1><5c0>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <5c1>   DW_AT_byte_size   : 4
    <5c2>   DW_AT_type        : <0x597>
 <1><5c6>: Abbrev Number: 5 (DW_TAG_const_type)
    <5c7>   DW_AT_type        : <0x5c0>
 <1><5cb>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <5cc>   DW_AT_byte_size   : 4
    <5cd>   DW_AT_type        : <0x5a2>
 <1><5d1>: Abbrev Number: 22 (DW_TAG_subroutine_type)
    <5d2>   DW_AT_prototyped  : 1
    <5d2>   DW_AT_type        : <0x122>
    <5d6>   DW_AT_sibling     : <0x5ef>
 <2><5da>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <5db>   DW_AT_type        : <0x423>
 <2><5df>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <5e0>   DW_AT_type        : <0xc8>
 <2><5e4>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <5e5>   DW_AT_type        : <0x122>
 <2><5e9>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <5ea>   DW_AT_type        : <0x29>
 <2><5ee>: Abbrev Number: 0
 <1><5ef>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <5f0>   DW_AT_byte_size   : 4
    <5f1>   DW_AT_type        : <0x5d1>
 <1><5f5>: Abbrev Number: 22 (DW_TAG_subroutine_type)
    <5f6>   DW_AT_prototyped  : 1
    <5f6>   DW_AT_type        : <0x29>
    <5fa>   DW_AT_sibling     : <0x609>
 <2><5fe>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <5ff>   DW_AT_type        : <0x423>
 <2><603>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <604>   DW_AT_type        : <0xc8>
 <2><608>: Abbrev Number: 0
 <1><609>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <60a>   DW_AT_byte_size   : 4
    <60b>   DW_AT_type        : <0x5f5>
 <1><60f>: Abbrev Number: 11 (DW_TAG_array_type)
    <610>   DW_AT_type        : <0x58>
    <614>   DW_AT_sibling     : <0x61f>
 <2><618>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <619>   DW_AT_type        : <0x30>
    <61d>   DW_AT_upper_bound : 2
 <2><61e>: Abbrev Number: 0
 <1><61f>: Abbrev Number: 11 (DW_TAG_array_type)
    <620>   DW_AT_type        : <0x58>
    <624>   DW_AT_sibling     : <0x62f>
 <2><628>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <629>   DW_AT_type        : <0x30>
    <62d>   DW_AT_upper_bound : 0
 <2><62e>: Abbrev Number: 0
 <1><62f>: Abbrev Number: 8 (DW_TAG_typedef)
    <630>   DW_AT_name        : (indirect string, offset: 0xa8159): __FILE
    <634>   DW_AT_decl_file   : 7
    <635>   DW_AT_decl_line   : 292
    <637>   DW_AT_decl_column : 26
    <638>   DW_AT_type        : <0x429>
 <1><63c>: Abbrev Number: 19 (DW_TAG_structure_type)
    <63d>   DW_AT_name        : (indirect string, offset: 0xb3f30): _glue
    <641>   DW_AT_byte_size   : 12
    <642>   DW_AT_decl_file   : 7
    <643>   DW_AT_decl_line   : 296
    <645>   DW_AT_decl_column : 8
    <646>   DW_AT_sibling     : <0x675>
 <2><64a>: Abbrev Number: 20 (DW_TAG_member)
    <64b>   DW_AT_name        : (indirect string, offset: 0x7c493): _next
    <64f>   DW_AT_decl_file   : 7
    <650>   DW_AT_decl_line   : 298
    <652>   DW_AT_decl_column : 17
    <653>   DW_AT_type        : <0x675>
    <657>   DW_AT_data_member_location: 0
 <2><658>: Abbrev Number: 20 (DW_TAG_member)
    <659>   DW_AT_name        : (indirect string, offset: 0x4e612): _niobs
    <65d>   DW_AT_decl_file   : 7
    <65e>   DW_AT_decl_line   : 299
    <660>   DW_AT_decl_column : 7
    <661>   DW_AT_type        : <0x29>
    <665>   DW_AT_data_member_location: 4
 <2><666>: Abbrev Number: 20 (DW_TAG_member)
    <667>   DW_AT_name        : (indirect string, offset: 0x6973c): _iobs
    <66b>   DW_AT_decl_file   : 7
    <66c>   DW_AT_decl_line   : 300
    <66e>   DW_AT_decl_column : 11
    <66f>   DW_AT_type        : <0x67b>
    <673>   DW_AT_data_member_location: 8
 <2><674>: Abbrev Number: 0
 <1><675>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <676>   DW_AT_byte_size   : 4
    <677>   DW_AT_type        : <0x63c>
 <1><67b>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <67c>   DW_AT_byte_size   : 4
    <67d>   DW_AT_type        : <0x62f>
 <1><681>: Abbrev Number: 19 (DW_TAG_structure_type)
    <682>   DW_AT_name        : (indirect string, offset: 0x48a80): _rand48
    <686>   DW_AT_byte_size   : 24
    <687>   DW_AT_decl_file   : 7
    <688>   DW_AT_decl_line   : 324
    <68a>   DW_AT_decl_column : 8
    <68b>   DW_AT_sibling     : <0x6c8>
 <2><68f>: Abbrev Number: 20 (DW_TAG_member)
    <690>   DW_AT_name        : (indirect string, offset: 0xce106): _seed
    <694>   DW_AT_decl_file   : 7
    <695>   DW_AT_decl_line   : 325
    <697>   DW_AT_decl_column : 18
    <698>   DW_AT_type        : <0x6c8>
    <69c>   DW_AT_data_member_location: 0
 <2><69d>: Abbrev Number: 20 (DW_TAG_member)
    <69e>   DW_AT_name        : (indirect string, offset: 0x11c0a): _mult
    <6a2>   DW_AT_decl_file   : 7
    <6a3>   DW_AT_decl_line   : 326
    <6a5>   DW_AT_decl_column : 18
    <6a6>   DW_AT_type        : <0x6c8>
    <6aa>   DW_AT_data_member_location: 6
 <2><6ab>: Abbrev Number: 20 (DW_TAG_member)
    <6ac>   DW_AT_name        : (indirect string, offset: 0x6b581): _add
    <6b0>   DW_AT_decl_file   : 7
    <6b1>   DW_AT_decl_line   : 327
    <6b3>   DW_AT_decl_column : 18
    <6b4>   DW_AT_type        : <0x72>
    <6b8>   DW_AT_data_member_location: 12
 <2><6b9>: Abbrev Number: 20 (DW_TAG_member)
    <6ba>   DW_AT_name        : (indirect string, offset: 0x7c48e): _rand_next
    <6be>   DW_AT_decl_file   : 7
    <6bf>   DW_AT_decl_line   : 330
    <6c1>   DW_AT_decl_column : 36
    <6c2>   DW_AT_type        : <0x93>
    <6c6>   DW_AT_data_member_location: 16
 <2><6c7>: Abbrev Number: 0
 <1><6c8>: Abbrev Number: 11 (DW_TAG_array_type)
    <6c9>   DW_AT_type        : <0x72>
    <6cd>   DW_AT_sibling     : <0x6d8>
 <2><6d1>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <6d2>   DW_AT_type        : <0x30>
    <6d6>   DW_AT_upper_bound : 2
 <2><6d7>: Abbrev Number: 0
 <1><6d8>: Abbrev Number: 19 (DW_TAG_structure_type)
    <6d9>   DW_AT_name        : (indirect string, offset: 0x9ffd5): _mprec
    <6dd>   DW_AT_byte_size   : 16
    <6de>   DW_AT_decl_file   : 7
    <6df>   DW_AT_decl_line   : 349
    <6e1>   DW_AT_decl_column : 8
    <6e2>   DW_AT_sibling     : <0x71f>
 <2><6e6>: Abbrev Number: 20 (DW_TAG_member)
    <6e7>   DW_AT_name        : (indirect string, offset: 0xd1715): _result
    <6eb>   DW_AT_decl_file   : 7
    <6ec>   DW_AT_decl_line   : 352
    <6ee>   DW_AT_decl_column : 19
    <6ef>   DW_AT_type        : <0x219>
    <6f3>   DW_AT_data_member_location: 0
 <2><6f4>: Abbrev Number: 20 (DW_TAG_member)
    <6f5>   DW_AT_name        : (indirect string, offset: 0x8283c): _result_k
    <6f9>   DW_AT_decl_file   : 7
    <6fa>   DW_AT_decl_line   : 353
    <6fc>   DW_AT_decl_column : 7
    <6fd>   DW_AT_type        : <0x29>
    <701>   DW_AT_data_member_location: 4
 <2><702>: Abbrev Number: 20 (DW_TAG_member)
    <703>   DW_AT_name        : (indirect string, offset: 0x63023): _p5s
    <707>   DW_AT_decl_file   : 7
    <708>   DW_AT_decl_line   : 354
    <70a>   DW_AT_decl_column : 19
    <70b>   DW_AT_type        : <0x219>
    <70f>   DW_AT_data_member_location: 8
 <2><710>: Abbrev Number: 20 (DW_TAG_member)
    <711>   DW_AT_name        : (indirect string, offset: 0x78632): _freelist
    <715>   DW_AT_decl_file   : 7
    <716>   DW_AT_decl_line   : 355
    <718>   DW_AT_decl_column : 20
    <719>   DW_AT_type        : <0x71f>
    <71d>   DW_AT_data_member_location: 12
 <2><71e>: Abbrev Number: 0
 <1><71f>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <720>   DW_AT_byte_size   : 4
    <721>   DW_AT_type        : <0x219>
 <1><725>: Abbrev Number: 19 (DW_TAG_structure_type)
    <726>   DW_AT_name        : (indirect string, offset: 0x62fc7): _misc_reent
    <72a>   DW_AT_byte_size   : 80
    <72b>   DW_AT_decl_file   : 7
    <72c>   DW_AT_decl_line   : 359
    <72e>   DW_AT_decl_column : 8
    <72f>   DW_AT_sibling     : <0x7ce>
 <2><733>: Abbrev Number: 20 (DW_TAG_member)
    <734>   DW_AT_name        : (indirect string, offset: 0xbfa22): _strtok_last
    <738>   DW_AT_decl_file   : 7
    <739>   DW_AT_decl_line   : 362
    <73b>   DW_AT_decl_column : 9
    <73c>   DW_AT_type        : <0x58a>
    <740>   DW_AT_data_member_location: 0
 <2><741>: Abbrev Number: 20 (DW_TAG_member)
    <742>   DW_AT_name        : (indirect string, offset: 0x5ac91): _mblen_state
    <746>   DW_AT_decl_file   : 7
    <747>   DW_AT_decl_line   : 363
    <749>   DW_AT_decl_column : 14
    <74a>   DW_AT_type        : <0x184>
    <74e>   DW_AT_data_member_location: 4
 <2><74f>: Abbrev Number: 20 (DW_TAG_member)
    <750>   DW_AT_name        : (indirect string, offset: 0x9b8ed): _wctomb_state
    <754>   DW_AT_decl_file   : 7
    <755>   DW_AT_decl_line   : 364
    <757>   DW_AT_decl_column : 14
    <758>   DW_AT_type        : <0x184>
    <75c>   DW_AT_data_member_location: 12
 <2><75d>: Abbrev Number: 20 (DW_TAG_member)
    <75e>   DW_AT_name        : (indirect string, offset: 0xb3068): _mbtowc_state
    <762>   DW_AT_decl_file   : 7
    <763>   DW_AT_decl_line   : 365
    <765>   DW_AT_decl_column : 14
    <766>   DW_AT_type        : <0x184>
    <76a>   DW_AT_data_member_location: 20
 <2><76b>: Abbrev Number: 20 (DW_TAG_member)
    <76c>   DW_AT_name        : (indirect string, offset: 0xb910e): _l64a_buf
    <770>   DW_AT_decl_file   : 7
    <771>   DW_AT_decl_line   : 366
    <773>   DW_AT_decl_column : 8
    <774>   DW_AT_type        : <0x7ce>
    <778>   DW_AT_data_member_location: 28
 <2><779>: Abbrev Number: 20 (DW_TAG_member)
    <77a>   DW_AT_name        : (indirect string, offset: 0xbe3e8): _getdate_err
    <77e>   DW_AT_decl_file   : 7
    <77f>   DW_AT_decl_line   : 367
    <781>   DW_AT_decl_column : 7
    <782>   DW_AT_type        : <0x29>
    <786>   DW_AT_data_member_location: 36
 <2><787>: Abbrev Number: 20 (DW_TAG_member)
    <788>   DW_AT_name        : (indirect string, offset: 0x646bc): _mbrlen_state
    <78c>   DW_AT_decl_file   : 7
    <78d>   DW_AT_decl_line   : 368
    <78f>   DW_AT_decl_column : 14
    <790>   DW_AT_type        : <0x184>
    <794>   DW_AT_data_member_location: 40
 <2><795>: Abbrev Number: 20 (DW_TAG_member)
    <796>   DW_AT_name        : (indirect string, offset: 0xbe932): _mbrtowc_state
    <79a>   DW_AT_decl_file   : 7
    <79b>   DW_AT_decl_line   : 369
    <79d>   DW_AT_decl_column : 14
    <79e>   DW_AT_type        : <0x184>
    <7a2>   DW_AT_data_member_location: 48
 <2><7a3>: Abbrev Number: 20 (DW_TAG_member)
    <7a4>   DW_AT_name        : (indirect string, offset: 0x7c188): _mbsrtowcs_state
    <7a8>   DW_AT_decl_file   : 7
    <7a9>   DW_AT_decl_line   : 370
    <7ab>   DW_AT_decl_column : 14
    <7ac>   DW_AT_type        : <0x184>
    <7b0>   DW_AT_data_member_location: 56
 <2><7b1>: Abbrev Number: 20 (DW_TAG_member)
    <7b2>   DW_AT_name        : (indirect string, offset: 0x40d1a): _wcrtomb_state
    <7b6>   DW_AT_decl_file   : 7
    <7b7>   DW_AT_decl_line   : 371
    <7b9>   DW_AT_decl_column : 14
    <7ba>   DW_AT_type        : <0x184>
    <7be>   DW_AT_data_member_location: 64
 <2><7bf>: Abbrev Number: 20 (DW_TAG_member)
    <7c0>   DW_AT_name        : (indirect string, offset: 0x765e3): _wcsrtombs_state
    <7c4>   DW_AT_decl_file   : 7
    <7c5>   DW_AT_decl_line   : 372
    <7c7>   DW_AT_decl_column : 14
    <7c8>   DW_AT_type        : <0x184>
    <7cc>   DW_AT_data_member_location: 72
 <2><7cd>: Abbrev Number: 0
 <1><7ce>: Abbrev Number: 11 (DW_TAG_array_type)
    <7cf>   DW_AT_type        : <0x590>
    <7d3>   DW_AT_sibling     : <0x7de>
 <2><7d7>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <7d8>   DW_AT_type        : <0x30>
    <7dc>   DW_AT_upper_bound : 7
 <2><7dd>: Abbrev Number: 0
 <1><7de>: Abbrev Number: 16 (DW_TAG_structure_type)
    <7df>   DW_AT_name        : (indirect string, offset: 0xb3f89): __locale_t
    <7e3>   DW_AT_declaration : 1
 <1><7e3>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <7e4>   DW_AT_byte_size   : 4
    <7e5>   DW_AT_type        : <0x7de>
 <1><7e9>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <7ea>   DW_AT_byte_size   : 4
    <7eb>   DW_AT_type        : <0x6d8>
 <1><7ef>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <7f0>   DW_AT_prototyped  : 1
    <7f0>   DW_AT_sibling     : <0x7fa>
 <2><7f4>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <7f5>   DW_AT_type        : <0x423>
 <2><7f9>: Abbrev Number: 0
 <1><7fa>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <7fb>   DW_AT_byte_size   : 4
    <7fc>   DW_AT_type        : <0x7ef>
 <1><800>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <801>   DW_AT_byte_size   : 4
    <802>   DW_AT_type        : <0x681>
 <1><806>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <807>   DW_AT_byte_size   : 4
    <808>   DW_AT_type        : <0x22f>
 <1><80c>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <80d>   DW_AT_prototyped  : 1
    <80d>   DW_AT_sibling     : <0x817>
 <2><811>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <812>   DW_AT_type        : <0x29>
 <2><816>: Abbrev Number: 0
 <1><817>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <818>   DW_AT_byte_size   : 4
    <819>   DW_AT_type        : <0x81d>
 <1><81d>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <81e>   DW_AT_byte_size   : 4
    <81f>   DW_AT_type        : <0x80c>
 <1><823>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <824>   DW_AT_byte_size   : 4
    <825>   DW_AT_type        : <0x725>
 <1><829>: Abbrev Number: 19 (DW_TAG_structure_type)
    <82a>   DW_AT_name        : (indirect string, offset: 0xaf708): xSTATIC_LIST_ITEM
    <82e>   DW_AT_byte_size   : 20
    <82f>   DW_AT_decl_file   : 9
    <830>   DW_AT_decl_line   : 1061
    <832>   DW_AT_decl_column : 8
    <833>   DW_AT_sibling     : <0x854>
 <2><837>: Abbrev Number: 20 (DW_TAG_member)
    <838>   DW_AT_name        : (indirect string, offset: 0xdb655): xDummy2
    <83c>   DW_AT_decl_file   : 9
    <83d>   DW_AT_decl_line   : 1066
    <83f>   DW_AT_decl_column : 13
    <840>   DW_AT_type        : <0xf8>
    <844>   DW_AT_data_member_location: 0
 <2><845>: Abbrev Number: 20 (DW_TAG_member)
    <846>   DW_AT_name        : (indirect string, offset: 0x4b74a): pvDummy3
    <84a>   DW_AT_decl_file   : 9
    <84b>   DW_AT_decl_line   : 1067
    <84d>   DW_AT_decl_column : 8
    <84e>   DW_AT_type        : <0x854>
    <852>   DW_AT_data_member_location: 4
 <2><853>: Abbrev Number: 0
 <1><854>: Abbrev Number: 11 (DW_TAG_array_type)
    <855>   DW_AT_type        : <0xc8>
    <859>   DW_AT_sibling     : <0x864>
 <2><85d>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <85e>   DW_AT_type        : <0x30>
    <862>   DW_AT_upper_bound : 3
 <2><863>: Abbrev Number: 0
 <1><864>: Abbrev Number: 8 (DW_TAG_typedef)
    <865>   DW_AT_name        : (indirect string, offset: 0x4ba83): StaticListItem_t
    <869>   DW_AT_decl_file   : 9
    <86a>   DW_AT_decl_line   : 1072
    <86c>   DW_AT_decl_column : 34
    <86d>   DW_AT_type        : <0x829>
 <1><871>: Abbrev Number: 19 (DW_TAG_structure_type)
    <872>   DW_AT_name        : (indirect string, offset: 0x772c9): xSTATIC_TCB
    <876>   DW_AT_byte_size   : 192
    <877>   DW_AT_decl_file   : 9
    <878>   DW_AT_decl_line   : 1112
    <87a>   DW_AT_decl_column : 16
    <87b>   DW_AT_sibling     : <0x936>
 <2><87f>: Abbrev Number: 20 (DW_TAG_member)
    <880>   DW_AT_name        : (indirect string, offset: 0x2a956): pxDummy1
    <884>   DW_AT_decl_file   : 9
    <885>   DW_AT_decl_line   : 1114
    <887>   DW_AT_decl_column : 11
    <888>   DW_AT_type        : <0xc8>
    <88c>   DW_AT_data_member_location: 0
 <2><88d>: Abbrev Number: 20 (DW_TAG_member)
    <88e>   DW_AT_name        : (indirect string, offset: 0x27f9c): xDummy3
    <892>   DW_AT_decl_file   : 9
    <893>   DW_AT_decl_line   : 1118
    <895>   DW_AT_decl_column : 19
    <896>   DW_AT_type        : <0x936>
    <89a>   DW_AT_data_member_location: 4
 <2><89b>: Abbrev Number: 20 (DW_TAG_member)
    <89c>   DW_AT_name        : (indirect string, offset: 0x1d3e0): uxDummy5
    <8a0>   DW_AT_decl_file   : 9
    <8a1>   DW_AT_decl_line   : 1119
    <8a3>   DW_AT_decl_column : 16
    <8a4>   DW_AT_type        : <0xe7>
    <8a8>   DW_AT_data_member_location: 44
 <2><8a9>: Abbrev Number: 20 (DW_TAG_member)
    <8aa>   DW_AT_name        : (indirect string, offset: 0x2a999): pxDummy6
    <8ae>   DW_AT_decl_file   : 9
    <8af>   DW_AT_decl_line   : 1120
    <8b1>   DW_AT_decl_column : 11
    <8b2>   DW_AT_type        : <0xc8>
    <8b6>   DW_AT_data_member_location: 48
 <2><8b7>: Abbrev Number: 20 (DW_TAG_member)
    <8b8>   DW_AT_name        : (indirect string, offset: 0x49f12): ucDummy7
    <8bc>   DW_AT_decl_file   : 9
    <8bd>   DW_AT_decl_line   : 1121
    <8bf>   DW_AT_decl_column : 13
    <8c0>   DW_AT_type        : <0x946>
    <8c4>   DW_AT_data_member_location: 52
 <2><8c5>: Abbrev Number: 20 (DW_TAG_member)
    <8c6>   DW_AT_name        : (indirect string, offset: 0x2a9a2): pxDummy8
    <8ca>   DW_AT_decl_file   : 9
    <8cb>   DW_AT_decl_line   : 1123
    <8cd>   DW_AT_decl_column : 11
    <8ce>   DW_AT_type        : <0xc8>
    <8d2>   DW_AT_data_member_location: 68
 <2><8d3>: Abbrev Number: 20 (DW_TAG_member)
    <8d4>   DW_AT_name        : (indirect string, offset: 0x2e270): uxDummy12
    <8d8>   DW_AT_decl_file   : 9
    <8d9>   DW_AT_decl_line   : 1132
    <8db>   DW_AT_decl_column : 16
    <8dc>   DW_AT_type        : <0x956>
    <8e0>   DW_AT_data_member_location: 72
 <2><8e1>: Abbrev Number: 20 (DW_TAG_member)
    <8e2>   DW_AT_name        : (indirect string, offset: 0x4bae): pxDummy14
    <8e6>   DW_AT_decl_file   : 9
    <8e7>   DW_AT_decl_line   : 1135
    <8e9>   DW_AT_decl_column : 11
    <8ea>   DW_AT_type        : <0xc8>
    <8ee>   DW_AT_data_member_location: 80
 <2><8ef>: Abbrev Number: 20 (DW_TAG_member)
    <8f0>   DW_AT_name        : (indirect string, offset: 0xa78ef): xDummy17
    <8f4>   DW_AT_decl_file   : 9
    <8f5>   DW_AT_decl_line   : 1144
    <8f7>   DW_AT_decl_column : 17
    <8f8>   DW_AT_type        : <0x2e0>
    <8fc>   DW_AT_data_member_location: 84
 <2><8fd>: Abbrev Number: 20 (DW_TAG_member)
    <8fe>   DW_AT_name        : (indirect string, offset: 0x1e8a7): ulDummy18
    <902>   DW_AT_decl_file   : 9
    <903>   DW_AT_decl_line   : 1147
    <905>   DW_AT_decl_column : 14
    <906>   DW_AT_type        : <0xb7>
    <90a>   DW_AT_data_member_location: 180
 <2><90b>: Abbrev Number: 20 (DW_TAG_member)
    <90c>   DW_AT_name        : (indirect string, offset: 0x40058): ucDummy19
    <910>   DW_AT_decl_file   : 9
    <911>   DW_AT_decl_line   : 1148
    <913>   DW_AT_decl_column : 13
    <914>   DW_AT_type        : <0x9a>
    <918>   DW_AT_data_member_location: 184
 <2><919>: Abbrev Number: 20 (DW_TAG_member)
    <91a>   DW_AT_name        : (indirect string, offset: 0xbd9aa): uxDummy20
    <91e>   DW_AT_decl_file   : 9
    <91f>   DW_AT_decl_line   : 1151
    <921>   DW_AT_decl_column : 13
    <922>   DW_AT_type        : <0x9a>
    <926>   DW_AT_data_member_location: 185
 <2><927>: Abbrev Number: 20 (DW_TAG_member)
    <928>   DW_AT_name        : (indirect string, offset: 0x116e2): iDummy22
    <92c>   DW_AT_decl_file   : 9
    <92d>   DW_AT_decl_line   : 1158
    <92f>   DW_AT_decl_column : 10
    <930>   DW_AT_type        : <0x29>
    <934>   DW_AT_data_member_location: 188
 <2><935>: Abbrev Number: 0
 <1><936>: Abbrev Number: 11 (DW_TAG_array_type)
    <937>   DW_AT_type        : <0x864>
    <93b>   DW_AT_sibling     : <0x946>
 <2><93f>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <940>   DW_AT_type        : <0x30>
    <944>   DW_AT_upper_bound : 1
 <2><945>: Abbrev Number: 0
 <1><946>: Abbrev Number: 11 (DW_TAG_array_type)
    <947>   DW_AT_type        : <0x9a>
    <94b>   DW_AT_sibling     : <0x956>
 <2><94f>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <950>   DW_AT_type        : <0x30>
    <954>   DW_AT_upper_bound : 15
 <2><955>: Abbrev Number: 0
 <1><956>: Abbrev Number: 11 (DW_TAG_array_type)
    <957>   DW_AT_type        : <0xe7>
    <95b>   DW_AT_sibling     : <0x966>
 <2><95f>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <960>   DW_AT_type        : <0x30>
    <964>   DW_AT_upper_bound : 1
 <2><965>: Abbrev Number: 0
 <1><966>: Abbrev Number: 8 (DW_TAG_typedef)
    <967>   DW_AT_name        : (indirect string, offset: 0x157bc): StaticTask_t
    <96b>   DW_AT_decl_file   : 9
    <96c>   DW_AT_decl_line   : 1160
    <96e>   DW_AT_decl_column : 3
    <96f>   DW_AT_type        : <0x871>
 <1><973>: Abbrev Number: 4 (DW_TAG_typedef)
    <974>   DW_AT_name        : (indirect string, offset: 0xa36d4): TaskHandle_t
    <978>   DW_AT_decl_file   : 10
    <979>   DW_AT_decl_line   : 70
    <97a>   DW_AT_decl_column : 37
    <97b>   DW_AT_type        : <0x97f>
 <1><97f>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <980>   DW_AT_byte_size   : 4
    <981>   DW_AT_type        : <0x985>
 <1><985>: Abbrev Number: 16 (DW_TAG_structure_type)
    <986>   DW_AT_name        : (indirect string, offset: 0xb2715): tskTaskControlBlock
    <98a>   DW_AT_declaration : 1
 <1><98a>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <98b>   DW_AT_byte_size   : 4
    <98c>   DW_AT_type        : <0xcf>
 <1><990>: Abbrev Number: 11 (DW_TAG_array_type)
    <991>   DW_AT_type        : <0xc3>
    <995>   DW_AT_sibling     : <0x9a0>
 <2><999>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <99a>   DW_AT_type        : <0x30>
    <99e>   DW_AT_upper_bound : 1
 <2><99f>: Abbrev Number: 0
 <1><9a0>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <9a1>   DW_AT_type        : <0x990>
 <1><9a5>: Abbrev Number: 25 (DW_TAG_structure_type)
    <9a6>   DW_AT_byte_size   : 40
    <9a7>   DW_AT_decl_file   : 11
    <9a8>   DW_AT_decl_line   : 458
    <9aa>   DW_AT_decl_column : 9
    <9ab>   DW_AT_sibling     : <0xa2e>
 <2><9af>: Abbrev Number: 20 (DW_TAG_member)
    <9b0>   DW_AT_name        : (indirect string, offset: 0x1898): MODER
    <9b4>   DW_AT_decl_file   : 11
    <9b5>   DW_AT_decl_line   : 460
    <9b7>   DW_AT_decl_column : 17
    <9b8>   DW_AT_type        : <0xc3>
    <9bc>   DW_AT_data_member_location: 0
 <2><9bd>: Abbrev Number: 20 (DW_TAG_member)
    <9be>   DW_AT_name        : (indirect string, offset: 0xa29cb): OTYPER
    <9c2>   DW_AT_decl_file   : 11
    <9c3>   DW_AT_decl_line   : 461
    <9c5>   DW_AT_decl_column : 17
    <9c6>   DW_AT_type        : <0xc3>
    <9ca>   DW_AT_data_member_location: 4
 <2><9cb>: Abbrev Number: 20 (DW_TAG_member)
    <9cc>   DW_AT_name        : (indirect string, offset: 0xb6a72): OSPEEDR
    <9d0>   DW_AT_decl_file   : 11
    <9d1>   DW_AT_decl_line   : 462
    <9d3>   DW_AT_decl_column : 17
    <9d4>   DW_AT_type        : <0xc3>
    <9d8>   DW_AT_data_member_location: 8
 <2><9d9>: Abbrev Number: 20 (DW_TAG_member)
    <9da>   DW_AT_name        : (indirect string, offset: 0x87755): PUPDR
    <9de>   DW_AT_decl_file   : 11
    <9df>   DW_AT_decl_line   : 463
    <9e1>   DW_AT_decl_column : 17
    <9e2>   DW_AT_type        : <0xc3>
    <9e6>   DW_AT_data_member_location: 12
 <2><9e7>: Abbrev Number: 21 (DW_TAG_member)
    <9e8>   DW_AT_name        : IDR
    <9ec>   DW_AT_decl_file   : 11
    <9ed>   DW_AT_decl_line   : 464
    <9ef>   DW_AT_decl_column : 17
    <9f0>   DW_AT_type        : <0xc3>
    <9f4>   DW_AT_data_member_location: 16
 <2><9f5>: Abbrev Number: 21 (DW_TAG_member)
    <9f6>   DW_AT_name        : ODR
    <9fa>   DW_AT_decl_file   : 11
    <9fb>   DW_AT_decl_line   : 465
    <9fd>   DW_AT_decl_column : 17
    <9fe>   DW_AT_type        : <0xc3>
    <a02>   DW_AT_data_member_location: 20
 <2><a03>: Abbrev Number: 20 (DW_TAG_member)
    <a04>   DW_AT_name        : (indirect string, offset: 0x2f17a): BSRR
    <a08>   DW_AT_decl_file   : 11
    <a09>   DW_AT_decl_line   : 466
    <a0b>   DW_AT_decl_column : 17
    <a0c>   DW_AT_type        : <0xc3>
    <a10>   DW_AT_data_member_location: 24
 <2><a11>: Abbrev Number: 20 (DW_TAG_member)
    <a12>   DW_AT_name        : (indirect string, offset: 0xb3f94): LCKR
    <a16>   DW_AT_decl_file   : 11
    <a17>   DW_AT_decl_line   : 467
    <a19>   DW_AT_decl_column : 17
    <a1a>   DW_AT_type        : <0xc3>
    <a1e>   DW_AT_data_member_location: 28
 <2><a1f>: Abbrev Number: 21 (DW_TAG_member)
    <a20>   DW_AT_name        : AFR
    <a24>   DW_AT_decl_file   : 11
    <a25>   DW_AT_decl_line   : 468
    <a27>   DW_AT_decl_column : 17
    <a28>   DW_AT_type        : <0x9a0>
    <a2c>   DW_AT_data_member_location: 32
 <2><a2d>: Abbrev Number: 0
 <1><a2e>: Abbrev Number: 8 (DW_TAG_typedef)
    <a2f>   DW_AT_name        : (indirect string, offset: 0xcbc13): GPIO_TypeDef
    <a33>   DW_AT_decl_file   : 11
    <a34>   DW_AT_decl_line   : 469
    <a36>   DW_AT_decl_column : 3
    <a37>   DW_AT_type        : <0x9a5>
 <1><a3b>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <a3c>   DW_AT_encoding    : 7	(unsigned)
    <a3d>   DW_AT_byte_size   : 1
    <a3e>   DW_AT_type        : <0x58>
    <a42>   DW_AT_decl_file   : 12
    <a43>   DW_AT_decl_line   : 68
    <a44>   DW_AT_decl_column : 1
    <a45>   DW_AT_sibling     : <0xa56>
 <2><a49>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a4a>   DW_AT_name        : (indirect string, offset: 0x2b604): GPIO_PIN_RESET
    <a4e>   DW_AT_const_value : 0
 <2><a4f>: Abbrev Number: 27 (DW_TAG_enumerator)
    <a50>   DW_AT_name        : (indirect string, offset: 0x34d7a): GPIO_PIN_SET
    <a54>   DW_AT_const_value : 1
 <2><a55>: Abbrev Number: 0
 <1><a56>: Abbrev Number: 4 (DW_TAG_typedef)
    <a57>   DW_AT_name        : (indirect string, offset: 0xce44c): GPIO_PinState
    <a5b>   DW_AT_decl_file   : 12
    <a5c>   DW_AT_decl_line   : 71
    <a5d>   DW_AT_decl_column : 2
    <a5e>   DW_AT_type        : <0xa3b>
 <1><a62>: Abbrev Number: 4 (DW_TAG_typedef)
    <a63>   DW_AT_name        : (indirect string, offset: 0xa2fc0): TimerHandle_t
    <a67>   DW_AT_decl_file   : 13
    <a68>   DW_AT_decl_line   : 77
    <a69>   DW_AT_decl_column : 34
    <a6a>   DW_AT_type        : <0xa6e>
 <1><a6e>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <a6f>   DW_AT_byte_size   : 4
    <a70>   DW_AT_type        : <0xa74>
 <1><a74>: Abbrev Number: 16 (DW_TAG_structure_type)
    <a75>   DW_AT_name        : (indirect string, offset: 0x229a1): tmrTimerControl
    <a79>   DW_AT_declaration : 1
 <1><a79>: Abbrev Number: 4 (DW_TAG_typedef)
    <a7a>   DW_AT_name        : (indirect string, offset: 0xc62e0): TimerCallbackFunction_t
    <a7e>   DW_AT_decl_file   : 13
    <a7f>   DW_AT_decl_line   : 82
    <a80>   DW_AT_decl_column : 16
    <a81>   DW_AT_type        : <0xa85>
 <1><a85>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <a86>   DW_AT_byte_size   : 4
    <a87>   DW_AT_type        : <0xa8b>
 <1><a8b>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <a8c>   DW_AT_prototyped  : 1
    <a8c>   DW_AT_sibling     : <0xa96>
 <2><a90>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <a91>   DW_AT_type        : <0xa62>
 <2><a95>: Abbrev Number: 0
 <1><a96>: Abbrev Number: 4 (DW_TAG_typedef)
    <a97>   DW_AT_name        : (indirect string, offset: 0xc19ae): QueueHandle_t
    <a9b>   DW_AT_decl_file   : 14
    <a9c>   DW_AT_decl_line   : 48
    <a9d>   DW_AT_decl_column : 34
    <a9e>   DW_AT_type        : <0xaa2>
 <1><aa2>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <aa3>   DW_AT_byte_size   : 4
    <aa4>   DW_AT_type        : <0xaa8>
 <1><aa8>: Abbrev Number: 16 (DW_TAG_structure_type)
    <aa9>   DW_AT_name        : (indirect string, offset: 0xc2989): QueueDefinition
    <aad>   DW_AT_declaration : 1
 <1><aad>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <aae>   DW_AT_encoding    : 5	(signed)
    <aaf>   DW_AT_byte_size   : 2
    <ab0>   DW_AT_type        : <0x5f>
    <ab4>   DW_AT_decl_file   : 15
    <ab5>   DW_AT_decl_line   : 172
    <ab6>   DW_AT_decl_column : 15
    <ab7>   DW_AT_sibling     : <0xaec>
 <2><abb>: Abbrev Number: 28 (DW_TAG_enumerator)
    <abc>   DW_AT_name        : (indirect string, offset: 0xb63cc): osPriorityIdle
    <ac0>   DW_AT_const_value : -3
 <2><ac1>: Abbrev Number: 28 (DW_TAG_enumerator)
    <ac2>   DW_AT_name        : (indirect string, offset: 0xc1415): osPriorityLow
    <ac6>   DW_AT_const_value : -2
 <2><ac7>: Abbrev Number: 28 (DW_TAG_enumerator)
    <ac8>   DW_AT_name        : (indirect string, offset: 0xc9a43): osPriorityBelowNormal
    <acc>   DW_AT_const_value : -1
 <2><acd>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ace>   DW_AT_name        : (indirect string, offset: 0xab18f): osPriorityNormal
    <ad2>   DW_AT_const_value : 0
 <2><ad3>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ad4>   DW_AT_name        : (indirect string, offset: 0x86598): osPriorityAboveNormal
    <ad8>   DW_AT_const_value : 1
 <2><ad9>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ada>   DW_AT_name        : (indirect string, offset: 0x287ac): osPriorityHigh
    <ade>   DW_AT_const_value : 2
 <2><adf>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ae0>   DW_AT_name        : (indirect string, offset: 0xbe237): osPriorityRealtime
    <ae4>   DW_AT_const_value : 3
 <2><ae5>: Abbrev Number: 27 (DW_TAG_enumerator)
    <ae6>   DW_AT_name        : (indirect string, offset: 0xb9929): osPriorityError
    <aea>   DW_AT_const_value : 132
 <2><aeb>: Abbrev Number: 0
 <1><aec>: Abbrev Number: 4 (DW_TAG_typedef)
    <aed>   DW_AT_name        : (indirect string, offset: 0xdb5eb): osPriority
    <af1>   DW_AT_decl_file   : 15
    <af2>   DW_AT_decl_line   : 181
    <af3>   DW_AT_decl_column : 3
    <af4>   DW_AT_type        : <0xaad>
 <1><af8>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <af9>   DW_AT_encoding    : 7	(unsigned)
    <afa>   DW_AT_byte_size   : 4
    <afb>   DW_AT_type        : <0x30>
    <aff>   DW_AT_decl_file   : 15
    <b00>   DW_AT_decl_line   : 189
    <b01>   DW_AT_decl_column : 15
    <b02>   DW_AT_sibling     : <0xb64>
 <2><b06>: Abbrev Number: 27 (DW_TAG_enumerator)
    <b07>   DW_AT_name        : (indirect string, offset: 0xb9670): osOK
    <b0b>   DW_AT_const_value : 0
 <2><b0c>: Abbrev Number: 27 (DW_TAG_enumerator)
    <b0d>   DW_AT_name        : (indirect string, offset: 0x9a554): osEventSignal
    <b11>   DW_AT_const_value : 8
 <2><b12>: Abbrev Number: 27 (DW_TAG_enumerator)
    <b13>   DW_AT_name        : (indirect string, offset: 0x1811): osEventMessage
    <b17>   DW_AT_const_value : 16
 <2><b18>: Abbrev Number: 27 (DW_TAG_enumerator)
    <b19>   DW_AT_name        : (indirect string, offset: 0x860a7): osEventMail
    <b1d>   DW_AT_const_value : 32
 <2><b1e>: Abbrev Number: 27 (DW_TAG_enumerator)
    <b1f>   DW_AT_name        : (indirect string, offset: 0x23b51): osEventTimeout
    <b23>   DW_AT_const_value : 64
 <2><b24>: Abbrev Number: 27 (DW_TAG_enumerator)
    <b25>   DW_AT_name        : (indirect string, offset: 0x3687e): osErrorParameter
    <b29>   DW_AT_const_value : 128
 <2><b2a>: Abbrev Number: 27 (DW_TAG_enumerator)
    <b2b>   DW_AT_name        : (indirect string, offset: 0x88ba8): osErrorResource
    <b2f>   DW_AT_const_value : 129
 <2><b30>: Abbrev Number: 27 (DW_TAG_enumerator)
    <b31>   DW_AT_name        : (indirect string, offset: 0x909a7): osErrorTimeoutResource
    <b35>   DW_AT_const_value : 193
 <2><b36>: Abbrev Number: 27 (DW_TAG_enumerator)
    <b37>   DW_AT_name        : (indirect string, offset: 0x38aaf): osErrorISR
    <b3b>   DW_AT_const_value : 130
 <2><b3c>: Abbrev Number: 27 (DW_TAG_enumerator)
    <b3d>   DW_AT_name        : (indirect string, offset: 0x1cc97): osErrorISRRecursive
    <b41>   DW_AT_const_value : 131
 <2><b42>: Abbrev Number: 27 (DW_TAG_enumerator)
    <b43>   DW_AT_name        : (indirect string, offset: 0xd090): osErrorPriority
    <b47>   DW_AT_const_value : 132
 <2><b48>: Abbrev Number: 27 (DW_TAG_enumerator)
    <b49>   DW_AT_name        : (indirect string, offset: 0x247de): osErrorNoMemory
    <b4d>   DW_AT_const_value : 133
 <2><b4e>: Abbrev Number: 27 (DW_TAG_enumerator)
    <b4f>   DW_AT_name        : (indirect string, offset: 0x91672): osErrorValue
    <b53>   DW_AT_const_value : 134
 <2><b54>: Abbrev Number: 27 (DW_TAG_enumerator)
    <b55>   DW_AT_name        : (indirect string, offset: 0x6ef1b): osErrorOS
    <b59>   DW_AT_const_value : 255
 <2><b5a>: Abbrev Number: 29 (DW_TAG_enumerator)
    <b5b>   DW_AT_name        : (indirect string, offset: 0x4386f): os_status_reserved
    <b5f>   DW_AT_const_value : 0x7fffffff
 <2><b63>: Abbrev Number: 0
 <1><b64>: Abbrev Number: 4 (DW_TAG_typedef)
    <b65>   DW_AT_name        : (indirect string, offset: 0x21611): osStatus
    <b69>   DW_AT_decl_file   : 15
    <b6a>   DW_AT_decl_line   : 205
    <b6b>   DW_AT_decl_column : 3
    <b6c>   DW_AT_type        : <0xaf8>
 <1><b70>: Abbrev Number: 4 (DW_TAG_typedef)
    <b71>   DW_AT_name        : (indirect string, offset: 0x6648f): os_pthread
    <b75>   DW_AT_decl_file   : 15
    <b76>   DW_AT_decl_line   : 228
    <b77>   DW_AT_decl_column : 16
    <b78>   DW_AT_type        : <0xb7c>
 <1><b7c>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <b7d>   DW_AT_byte_size   : 4
    <b7e>   DW_AT_type        : <0xb82>
 <1><b82>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <b83>   DW_AT_prototyped  : 1
    <b83>   DW_AT_sibling     : <0xb8d>
 <2><b87>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <b88>   DW_AT_type        : <0xb8d>
 <2><b8c>: Abbrev Number: 0
 <1><b8d>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <b8e>   DW_AT_byte_size   : 4
    <b8f>   DW_AT_type        : <0xb93>
 <1><b93>: Abbrev Number: 30 (DW_TAG_const_type)
 <1><b94>: Abbrev Number: 4 (DW_TAG_typedef)
    <b95>   DW_AT_name        : (indirect string, offset: 0x26015): osThreadId
    <b99>   DW_AT_decl_file   : 15
    <b9a>   DW_AT_decl_line   : 238
    <b9b>   DW_AT_decl_column : 22
    <b9c>   DW_AT_type        : <0x973>
 <1><ba0>: Abbrev Number: 8 (DW_TAG_typedef)
    <ba1>   DW_AT_name        : (indirect string, offset: 0x82a79): osStaticThreadDef_t
    <ba5>   DW_AT_decl_file   : 15
    <ba6>   DW_AT_decl_line   : 267
    <ba8>   DW_AT_decl_column : 36
    <ba9>   DW_AT_type        : <0x966>
 <1><bad>: Abbrev Number: 19 (DW_TAG_structure_type)
    <bae>   DW_AT_name        : (indirect string, offset: 0x2a7c3): os_thread_def
    <bb2>   DW_AT_byte_size   : 28
    <bb3>   DW_AT_decl_file   : 15
    <bb4>   DW_AT_decl_line   : 280
    <bb6>   DW_AT_decl_column : 16
    <bb7>   DW_AT_sibling     : <0xc1e>
 <2><bbb>: Abbrev Number: 20 (DW_TAG_member)
    <bbc>   DW_AT_name        : (indirect string, offset: 0xbbb42): name
    <bc0>   DW_AT_decl_file   : 15
    <bc1>   DW_AT_decl_line   : 281
    <bc3>   DW_AT_decl_column : 27
    <bc4>   DW_AT_type        : <0x58a>
    <bc8>   DW_AT_data_member_location: 0
 <2><bc9>: Abbrev Number: 20 (DW_TAG_member)
    <bca>   DW_AT_name        : (indirect string, offset: 0x66492): pthread
    <bce>   DW_AT_decl_file   : 15
    <bcf>   DW_AT_decl_line   : 282
    <bd1>   DW_AT_decl_column : 26
    <bd2>   DW_AT_type        : <0xb70>
    <bd6>   DW_AT_data_member_location: 4
 <2><bd7>: Abbrev Number: 20 (DW_TAG_member)
    <bd8>   DW_AT_name        : (indirect string, offset: 0x9801e): tpriority
    <bdc>   DW_AT_decl_file   : 15
    <bdd>   DW_AT_decl_line   : 283
    <bdf>   DW_AT_decl_column : 26
    <be0>   DW_AT_type        : <0xaec>
    <be4>   DW_AT_data_member_location: 8
 <2><be5>: Abbrev Number: 20 (DW_TAG_member)
    <be6>   DW_AT_name        : (indirect string, offset: 0x566b8): instances
    <bea>   DW_AT_decl_file   : 15
    <beb>   DW_AT_decl_line   : 284
    <bed>   DW_AT_decl_column : 26
    <bee>   DW_AT_type        : <0xb7>
    <bf2>   DW_AT_data_member_location: 12
 <2><bf3>: Abbrev Number: 20 (DW_TAG_member)
    <bf4>   DW_AT_name        : (indirect string, offset: 0x10bbe): stacksize
    <bf8>   DW_AT_decl_file   : 15
    <bf9>   DW_AT_decl_line   : 285
    <bfb>   DW_AT_decl_column : 26
    <bfc>   DW_AT_type        : <0xb7>
    <c00>   DW_AT_data_member_location: 16
 <2><c01>: Abbrev Number: 20 (DW_TAG_member)
    <c02>   DW_AT_name        : (indirect string, offset: 0x2042d): buffer
    <c06>   DW_AT_decl_file   : 15
    <c07>   DW_AT_decl_line   : 287
    <c09>   DW_AT_decl_column : 27
    <c0a>   DW_AT_type        : <0xc1e>
    <c0e>   DW_AT_data_member_location: 20
 <2><c0f>: Abbrev Number: 20 (DW_TAG_member)
    <c10>   DW_AT_name        : (indirect string, offset: 0x5e985): controlblock
    <c14>   DW_AT_decl_file   : 15
    <c15>   DW_AT_decl_line   : 288
    <c17>   DW_AT_decl_column : 27
    <c18>   DW_AT_type        : <0xc24>
    <c1c>   DW_AT_data_member_location: 24
 <2><c1d>: Abbrev Number: 0
 <1><c1e>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <c1f>   DW_AT_byte_size   : 4
    <c20>   DW_AT_type        : <0xb7>
 <1><c24>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <c25>   DW_AT_byte_size   : 4
    <c26>   DW_AT_type        : <0xba0>
 <1><c2a>: Abbrev Number: 8 (DW_TAG_typedef)
    <c2b>   DW_AT_name        : (indirect string, offset: 0x10554): osThreadDef_t
    <c2f>   DW_AT_decl_file   : 15
    <c30>   DW_AT_decl_line   : 290
    <c32>   DW_AT_decl_column : 3
    <c33>   DW_AT_type        : <0xbad>
 <1><c37>: Abbrev Number: 5 (DW_TAG_const_type)
    <c38>   DW_AT_type        : <0xc2a>
 <1><c3c>: Abbrev Number: 31 (DW_TAG_variable)
    <c3d>   DW_AT_name        : (indirect string, offset: 0x6563b): xQueue1
    <c41>   DW_AT_decl_file   : 1
    <c42>   DW_AT_decl_line   : 49
    <c43>   DW_AT_decl_column : 15
    <c44>   DW_AT_type        : <0xa96>
    <c48>   DW_AT_external    : 1
    <c48>   DW_AT_location    : 5 byte block: 3 90 0 0 20 	(DW_OP_addr: 20000090)
 <1><c4e>: Abbrev Number: 31 (DW_TAG_variable)
    <c4f>   DW_AT_name        : (indirect string, offset: 0x65643): xQueue2
    <c53>   DW_AT_decl_file   : 1
    <c54>   DW_AT_decl_line   : 49
    <c55>   DW_AT_decl_column : 24
    <c56>   DW_AT_type        : <0xa96>
    <c5a>   DW_AT_external    : 1
    <c5a>   DW_AT_location    : 5 byte block: 3 94 0 0 20 	(DW_OP_addr: 20000094)
 <1><c60>: Abbrev Number: 31 (DW_TAG_variable)
    <c61>   DW_AT_name        : (indirect string, offset: 0x37232): xTimer1
    <c65>   DW_AT_decl_file   : 1
    <c66>   DW_AT_decl_line   : 50
    <c67>   DW_AT_decl_column : 15
    <c68>   DW_AT_type        : <0xa62>
    <c6c>   DW_AT_external    : 1
    <c6c>   DW_AT_location    : 5 byte block: 3 98 0 0 20 	(DW_OP_addr: 20000098)
 <1><c72>: Abbrev Number: 31 (DW_TAG_variable)
    <c73>   DW_AT_name        : (indirect string, offset: 0xb11a4): Sine
    <c77>   DW_AT_decl_file   : 1
    <c78>   DW_AT_decl_line   : 51
    <c79>   DW_AT_decl_column : 12
    <c7a>   DW_AT_type        : <0xdb>
    <c7e>   DW_AT_external    : 1
    <c7e>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><c84>: Abbrev Number: 31 (DW_TAG_variable)
    <c85>   DW_AT_name        : (indirect string, offset: 0x9739b): xTask
    <c89>   DW_AT_decl_file   : 1
    <c8a>   DW_AT_decl_line   : 52
    <c8b>   DW_AT_decl_column : 14
    <c8c>   DW_AT_type        : <0x973>
    <c90>   DW_AT_external    : 1
    <c90>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><c96>: Abbrev Number: 31 (DW_TAG_variable)
    <c97>   DW_AT_name        : (indirect string, offset: 0x52c58): defaultTaskHandle
    <c9b>   DW_AT_decl_file   : 1
    <c9c>   DW_AT_decl_line   : 54
    <c9d>   DW_AT_decl_column : 12
    <c9e>   DW_AT_type        : <0xb94>
    <ca2>   DW_AT_external    : 1
    <ca2>   DW_AT_location    : 5 byte block: 3 9c 0 0 20 	(DW_OP_addr: 2000009c)
 <1><ca8>: Abbrev Number: 32 (DW_TAG_variable)
    <ca9>   DW_AT_name        : (indirect string, offset: 0x6dee2): xIdleTaskTCBBuffer
    <cad>   DW_AT_decl_file   : 1
    <cae>   DW_AT_decl_line   : 104
    <caf>   DW_AT_decl_column : 21
    <cb0>   DW_AT_type        : <0x966>
    <cb4>   DW_AT_location    : 5 byte block: 3 a0 0 0 20 	(DW_OP_addr: 200000a0)
 <1><cba>: Abbrev Number: 11 (DW_TAG_array_type)
    <cbb>   DW_AT_type        : <0xcf>
    <cbf>   DW_AT_sibling     : <0xcca>
 <2><cc3>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <cc4>   DW_AT_type        : <0x30>
    <cc8>   DW_AT_upper_bound : 127
 <2><cc9>: Abbrev Number: 0
 <1><cca>: Abbrev Number: 32 (DW_TAG_variable)
    <ccb>   DW_AT_name        : (indirect string, offset: 0x3f7ec): xIdleStack
    <ccf>   DW_AT_decl_file   : 1
    <cd0>   DW_AT_decl_line   : 105
    <cd1>   DW_AT_decl_column : 20
    <cd2>   DW_AT_type        : <0xcba>
    <cd6>   DW_AT_location    : 5 byte block: 3 60 1 0 20 	(DW_OP_addr: 20000160)
 <1><cdc>: Abbrev Number: 32 (DW_TAG_variable)
    <cdd>   DW_AT_name        : (indirect string, offset: 0xa9a67): xTimerTaskTCBBuffer
    <ce1>   DW_AT_decl_file   : 1
    <ce2>   DW_AT_decl_line   : 117
    <ce3>   DW_AT_decl_column : 21
    <ce4>   DW_AT_type        : <0x966>
    <ce8>   DW_AT_location    : 5 byte block: 3 60 3 0 20 	(DW_OP_addr: 20000360)
 <1><cee>: Abbrev Number: 11 (DW_TAG_array_type)
    <cef>   DW_AT_type        : <0xcf>
    <cf3>   DW_AT_sibling     : <0xcfe>
 <2><cf7>: Abbrev Number: 12 (DW_TAG_subrange_type)
    <cf8>   DW_AT_type        : <0x30>
    <cfc>   DW_AT_upper_bound : 255
 <2><cfd>: Abbrev Number: 0
 <1><cfe>: Abbrev Number: 32 (DW_TAG_variable)
    <cff>   DW_AT_name        : (indirect string, offset: 0xb82c0): xTimerStack
    <d03>   DW_AT_decl_file   : 1
    <d04>   DW_AT_decl_line   : 118
    <d05>   DW_AT_decl_column : 20
    <d06>   DW_AT_type        : <0xcee>
    <d0a>   DW_AT_location    : 5 byte block: 3 20 4 0 20 	(DW_OP_addr: 20000420)
 <1><d10>: Abbrev Number: 33 (DW_TAG_subprogram)
    <d11>   DW_AT_external    : 1
    <d11>   DW_AT_name        : (indirect string, offset: 0x7b489): vTaskDelay
    <d15>   DW_AT_decl_file   : 10
    <d16>   DW_AT_decl_line   : 758
    <d18>   DW_AT_decl_column : 6
    <d19>   DW_AT_prototyped  : 1
    <d19>   DW_AT_declaration : 1
    <d19>   DW_AT_sibling     : <0xd23>
 <2><d1d>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <d1e>   DW_AT_type        : <0x104>
 <2><d22>: Abbrev Number: 0
 <1><d23>: Abbrev Number: 34 (DW_TAG_subprogram)
    <d24>   DW_AT_external    : 1
    <d24>   DW_AT_name        : (indirect string, offset: 0x255b0): HAL_GPIO_WritePin
    <d28>   DW_AT_decl_file   : 12
    <d29>   DW_AT_decl_line   : 235
    <d2a>   DW_AT_decl_column : 6
    <d2b>   DW_AT_prototyped  : 1
    <d2b>   DW_AT_declaration : 1
    <d2b>   DW_AT_sibling     : <0xd3f>
 <2><d2f>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <d30>   DW_AT_type        : <0xd3f>
 <2><d34>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <d35>   DW_AT_type        : <0xab>
 <2><d39>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <d3a>   DW_AT_type        : <0xa56>
 <2><d3e>: Abbrev Number: 0
 <1><d3f>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <d40>   DW_AT_byte_size   : 4
    <d41>   DW_AT_type        : <0xa2e>
 <1><d45>: Abbrev Number: 35 (DW_TAG_subprogram)
    <d46>   DW_AT_external    : 1
    <d46>   DW_AT_name        : (indirect string, offset: 0xcfd82): osDelay
    <d4a>   DW_AT_decl_file   : 15
    <d4b>   DW_AT_decl_line   : 478
    <d4d>   DW_AT_decl_column : 10
    <d4e>   DW_AT_prototyped  : 1
    <d4e>   DW_AT_type        : <0xb64>
    <d52>   DW_AT_declaration : 1
    <d52>   DW_AT_sibling     : <0xd5c>
 <2><d56>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <d57>   DW_AT_type        : <0xb7>
 <2><d5b>: Abbrev Number: 0
 <1><d5c>: Abbrev Number: 35 (DW_TAG_subprogram)
    <d5d>   DW_AT_external    : 1
    <d5d>   DW_AT_name        : (indirect string, offset: 0x4efe0): osThreadCreate
    <d61>   DW_AT_decl_file   : 15
    <d62>   DW_AT_decl_line   : 441
    <d64>   DW_AT_decl_column : 12
    <d65>   DW_AT_prototyped  : 1
    <d65>   DW_AT_type        : <0xb94>
    <d69>   DW_AT_declaration : 1
    <d69>   DW_AT_sibling     : <0xd78>
 <2><d6d>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <d6e>   DW_AT_type        : <0xd78>
 <2><d72>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <d73>   DW_AT_type        : <0xc8>
 <2><d77>: Abbrev Number: 0
 <1><d78>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <d79>   DW_AT_byte_size   : 4
    <d7a>   DW_AT_type        : <0xc37>
 <1><d7e>: Abbrev Number: 35 (DW_TAG_subprogram)
    <d7f>   DW_AT_external    : 1
    <d7f>   DW_AT_name        : (indirect string, offset: 0x5b4f5): xQueueGenericCreate
    <d83>   DW_AT_decl_file   : 14
    <d84>   DW_AT_decl_line   : 1496
    <d86>   DW_AT_decl_column : 16
    <d87>   DW_AT_prototyped  : 1
    <d87>   DW_AT_type        : <0xa96>
    <d8b>   DW_AT_declaration : 1
    <d8b>   DW_AT_sibling     : <0xd9f>
 <2><d8f>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <d90>   DW_AT_type        : <0xf3>
 <2><d94>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <d95>   DW_AT_type        : <0xf3>
 <2><d99>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <d9a>   DW_AT_type        : <0xa6>
 <2><d9e>: Abbrev Number: 0
 <1><d9f>: Abbrev Number: 36 (DW_TAG_subprogram)
    <da0>   DW_AT_external    : 1
    <da0>   DW_AT_name        : (indirect string, offset: 0xcab69): xTimerCreate
    <da4>   DW_AT_decl_file   : 13
    <da5>   DW_AT_decl_line   : 228
    <da6>   DW_AT_decl_column : 16
    <da7>   DW_AT_prototyped  : 1
    <da7>   DW_AT_type        : <0xa62>
    <dab>   DW_AT_declaration : 1
    <dab>   DW_AT_sibling     : <0xdc9>
 <2><daf>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <db0>   DW_AT_type        : <0x5c6>
 <2><db4>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <db5>   DW_AT_type        : <0x104>
 <2><db9>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <dba>   DW_AT_type        : <0xf3>
 <2><dbe>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <dbf>   DW_AT_type        : <0xca>
 <2><dc3>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <dc4>   DW_AT_type        : <0xa79>
 <2><dc8>: Abbrev Number: 0
 <1><dc9>: Abbrev Number: 37 (DW_TAG_subprogram)
    <dca>   DW_AT_external    : 1
    <dca>   DW_AT_name        : (indirect string, offset: 0x73f52): vTimerCallback
    <dce>   DW_AT_decl_file   : 1
    <dcf>   DW_AT_decl_line   : 192
    <dd0>   DW_AT_decl_column : 6
    <dd1>   DW_AT_prototyped  : 1
    <dd1>   DW_AT_low_pc      : 0x8000634
    <dd5>   DW_AT_high_pc     : 0x34
    <dd9>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ddb>   DW_AT_GNU_all_tail_call_sites: 1
    <ddb>   DW_AT_sibling     : <0xdef>
 <2><ddf>: Abbrev Number: 38 (DW_TAG_formal_parameter)
    <de0>   DW_AT_name        : (indirect string, offset: 0xddb40): xTimer
    <de4>   DW_AT_decl_file   : 1
    <de5>   DW_AT_decl_line   : 192
    <de6>   DW_AT_decl_column : 36
    <de7>   DW_AT_type        : <0xa62>
    <deb>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><dee>: Abbrev Number: 0
 <1><def>: Abbrev Number: 37 (DW_TAG_subprogram)
    <df0>   DW_AT_external    : 1
    <df0>   DW_AT_name        : (indirect string, offset: 0x2e8b5): StartDefaultTask
    <df4>   DW_AT_decl_file   : 1
    <df5>   DW_AT_decl_line   : 178
    <df6>   DW_AT_decl_column : 6
    <df7>   DW_AT_prototyped  : 1
    <df7>   DW_AT_low_pc      : 0x8000624
    <dfb>   DW_AT_high_pc     : 0x10
    <dff>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e01>   DW_AT_GNU_all_tail_call_sites: 1
    <e01>   DW_AT_sibling     : <0xe15>
 <2><e05>: Abbrev Number: 38 (DW_TAG_formal_parameter)
    <e06>   DW_AT_name        : (indirect string, offset: 0x2cf25): argument
    <e0a>   DW_AT_decl_file   : 1
    <e0b>   DW_AT_decl_line   : 178
    <e0c>   DW_AT_decl_column : 36
    <e0d>   DW_AT_type        : <0xb8d>
    <e11>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><e14>: Abbrev Number: 0
 <1><e15>: Abbrev Number: 37 (DW_TAG_subprogram)
    <e16>   DW_AT_external    : 1
    <e16>   DW_AT_name        : (indirect string, offset: 0xa8fbb): MX_FREERTOS_Init
    <e1a>   DW_AT_decl_file   : 1
    <e1b>   DW_AT_decl_line   : 134
    <e1c>   DW_AT_decl_column : 6
    <e1d>   DW_AT_prototyped  : 1
    <e1d>   DW_AT_low_pc      : 0x80005a0
    <e21>   DW_AT_high_pc     : 0x84
    <e25>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e27>   DW_AT_GNU_all_tail_call_sites: 1
    <e27>   DW_AT_sibling     : <0xe3b>
 <2><e2b>: Abbrev Number: 32 (DW_TAG_variable)
    <e2c>   DW_AT_name        : (indirect string, offset: 0x9e665): os_thread_def_defaultTask
    <e30>   DW_AT_decl_file   : 1
    <e31>   DW_AT_decl_line   : 161
    <e32>   DW_AT_decl_column : 3
    <e33>   DW_AT_type        : <0xc37>
    <e37>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><e3a>: Abbrev Number: 0
 <1><e3b>: Abbrev Number: 39 (DW_TAG_subprogram)
    <e3c>   DW_AT_external    : 1
    <e3c>   DW_AT_name        : (indirect string, offset: 0xac312): vApplicationGetTimerTaskMemory
    <e40>   DW_AT_decl_file   : 1
    <e41>   DW_AT_decl_line   : 120
    <e42>   DW_AT_decl_column : 6
    <e43>   DW_AT_prototyped  : 1
    <e43>   DW_AT_low_pc      : 0x800056c
    <e47>   DW_AT_high_pc     : 0x34
    <e4b>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e4d>   DW_AT_GNU_all_call_sites: 1
    <e4d>   DW_AT_sibling     : <0xe7f>
 <2><e51>: Abbrev Number: 38 (DW_TAG_formal_parameter)
    <e52>   DW_AT_name        : (indirect string, offset: 0xa9a65): ppxTimerTaskTCBBuffer
    <e56>   DW_AT_decl_file   : 1
    <e57>   DW_AT_decl_line   : 120
    <e58>   DW_AT_decl_column : 53
    <e59>   DW_AT_type        : <0xe7f>
    <e5d>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><e60>: Abbrev Number: 38 (DW_TAG_formal_parameter)
    <e61>   DW_AT_name        : (indirect string, offset: 0x22349): ppxTimerTaskStackBuffer
    <e65>   DW_AT_decl_file   : 1
    <e66>   DW_AT_decl_line   : 120
    <e67>   DW_AT_decl_column : 90
    <e68>   DW_AT_type        : <0xe8b>
    <e6c>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><e6f>: Abbrev Number: 38 (DW_TAG_formal_parameter)
    <e70>   DW_AT_name        : (indirect string, offset: 0x4cb47): pulTimerTaskStackSize
    <e74>   DW_AT_decl_file   : 1
    <e75>   DW_AT_decl_line   : 120
    <e76>   DW_AT_decl_column : 125
    <e77>   DW_AT_type        : <0xc1e>
    <e7b>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><e7e>: Abbrev Number: 0
 <1><e7f>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <e80>   DW_AT_byte_size   : 4
    <e81>   DW_AT_type        : <0xe85>
 <1><e85>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <e86>   DW_AT_byte_size   : 4
    <e87>   DW_AT_type        : <0x966>
 <1><e8b>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <e8c>   DW_AT_byte_size   : 4
    <e8d>   DW_AT_type        : <0x98a>
 <1><e91>: Abbrev Number: 39 (DW_TAG_subprogram)
    <e92>   DW_AT_external    : 1
    <e92>   DW_AT_name        : (indirect string, offset: 0xb1d8e): vApplicationGetIdleTaskMemory
    <e96>   DW_AT_decl_file   : 1
    <e97>   DW_AT_decl_line   : 107
    <e98>   DW_AT_decl_column : 6
    <e99>   DW_AT_prototyped  : 1
    <e99>   DW_AT_low_pc      : 0x8000538
    <e9d>   DW_AT_high_pc     : 0x34
    <ea1>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ea3>   DW_AT_GNU_all_call_sites: 1
    <ea3>   DW_AT_sibling     : <0xed5>
 <2><ea7>: Abbrev Number: 38 (DW_TAG_formal_parameter)
    <ea8>   DW_AT_name        : (indirect string, offset: 0x6dee0): ppxIdleTaskTCBBuffer
    <eac>   DW_AT_decl_file   : 1
    <ead>   DW_AT_decl_line   : 107
    <eae>   DW_AT_decl_column : 52
    <eaf>   DW_AT_type        : <0xe7f>
    <eb3>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><eb6>: Abbrev Number: 38 (DW_TAG_formal_parameter)
    <eb7>   DW_AT_name        : (indirect string, offset: 0x789a7): ppxIdleTaskStackBuffer
    <ebb>   DW_AT_decl_file   : 1
    <ebc>   DW_AT_decl_line   : 107
    <ebd>   DW_AT_decl_column : 88
    <ebe>   DW_AT_type        : <0xe8b>
    <ec2>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><ec5>: Abbrev Number: 38 (DW_TAG_formal_parameter)
    <ec6>   DW_AT_name        : (indirect string, offset: 0x722e3): pulIdleTaskStackSize
    <eca>   DW_AT_decl_file   : 1
    <ecb>   DW_AT_decl_line   : 107
    <ecc>   DW_AT_decl_column : 122
    <ecd>   DW_AT_type        : <0xc1e>
    <ed1>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><ed4>: Abbrev Number: 0
 <1><ed5>: Abbrev Number: 40 (DW_TAG_subprogram)
    <ed6>   DW_AT_external    : 1
    <ed6>   DW_AT_name        : (indirect string, offset: 0x380a2): vApplicationMallocFailedHook
    <eda>   DW_AT_decl_file   : 1
    <edb>   DW_AT_decl_line   : 88
    <edc>   DW_AT_decl_column : 13
    <edd>   DW_AT_prototyped  : 1
    <edd>   DW_AT_low_pc      : 0x800052a
    <ee1>   DW_AT_high_pc     : 0xe
    <ee5>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ee7>   DW_AT_GNU_all_call_sites: 1
 <1><ee7>: Abbrev Number: 39 (DW_TAG_subprogram)
    <ee8>   DW_AT_external    : 1
    <ee8>   DW_AT_name        : (indirect string, offset: 0x4c26f): vApplicationStackOverflowHook
    <eec>   DW_AT_decl_file   : 1
    <eed>   DW_AT_decl_line   : 77
    <eee>   DW_AT_decl_column : 13
    <eef>   DW_AT_prototyped  : 1
    <eef>   DW_AT_low_pc      : 0x8000514
    <ef3>   DW_AT_high_pc     : 0x16
    <ef7>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ef9>   DW_AT_GNU_all_call_sites: 1
    <ef9>   DW_AT_sibling     : <0xf1c>
 <2><efd>: Abbrev Number: 38 (DW_TAG_formal_parameter)
    <efe>   DW_AT_name        : (indirect string, offset: 0x9739b): xTask
    <f02>   DW_AT_decl_file   : 1
    <f03>   DW_AT_decl_line   : 77
    <f04>   DW_AT_decl_column : 56
    <f05>   DW_AT_type        : <0x973>
    <f09>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><f0c>: Abbrev Number: 38 (DW_TAG_formal_parameter)
    <f0d>   DW_AT_name        : (indirect string, offset: 0x98a64): pcTaskName
    <f11>   DW_AT_decl_file   : 1
    <f12>   DW_AT_decl_line   : 77
    <f13>   DW_AT_decl_column : 76
    <f14>   DW_AT_type        : <0xf1c>
    <f18>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><f1b>: Abbrev Number: 0
 <1><f1c>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <f1d>   DW_AT_byte_size   : 4
    <f1e>   DW_AT_type        : <0x45>
 <1><f22>: Abbrev Number: 0
  Compilation Unit @ offset 0xf23:
   Length:        0x4a5 (32-bit)
   Version:       4
   Abbrev Offset: 0x253
   Pointer Size:  4
 <0><f2e>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <f2f>   DW_AT_producer    : (indirect string, offset: 0xad480): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <f33>   DW_AT_language    : 12	(ANSI C99)
    <f34>   DW_AT_name        : (indirect string, offset: 0xd29aa): ../Core/Src/gpio.c
    <f38>   DW_AT_comp_dir    : (indirect string, offset: 0x4e154): /home/c/STM32CubeIDE/workspace_1.12.1/PK_FZ/second/Debug
    <f3c>   DW_AT_ranges      : 0x40
    <f40>   DW_AT_low_pc      : 0x0
    <f44>   DW_AT_stmt_list   : 0xa2b
    <f48>   DW_AT_GNU_macros  : 0x20e57
 <1><f4c>: Abbrev Number: 2 (DW_TAG_base_type)
    <f4d>   DW_AT_byte_size   : 1
    <f4e>   DW_AT_encoding    : 6	(signed char)
    <f4f>   DW_AT_name        : (indirect string, offset: 0x6894d): signed char
 <1><f53>: Abbrev Number: 2 (DW_TAG_base_type)
    <f54>   DW_AT_byte_size   : 1
    <f55>   DW_AT_encoding    : 8	(unsigned char)
    <f56>   DW_AT_name        : (indirect string, offset: 0xca864): unsigned char
 <1><f5a>: Abbrev Number: 2 (DW_TAG_base_type)
    <f5b>   DW_AT_byte_size   : 2
    <f5c>   DW_AT_encoding    : 5	(signed)
    <f5d>   DW_AT_name        : (indirect string, offset: 0x9c97d): short int
 <1><f61>: Abbrev Number: 3 (DW_TAG_typedef)
    <f62>   DW_AT_name        : (indirect string, offset: 0xab859): __uint16_t
    <f66>   DW_AT_decl_file   : 2
    <f67>   DW_AT_decl_line   : 57
    <f68>   DW_AT_decl_column : 25
    <f69>   DW_AT_type        : <0xf6d>
 <1><f6d>: Abbrev Number: 2 (DW_TAG_base_type)
    <f6e>   DW_AT_byte_size   : 2
    <f6f>   DW_AT_encoding    : 7	(unsigned)
    <f70>   DW_AT_name        : (indirect string, offset: 0xc91b5): short unsigned int
 <1><f74>: Abbrev Number: 2 (DW_TAG_base_type)
    <f75>   DW_AT_byte_size   : 4
    <f76>   DW_AT_encoding    : 5	(signed)
    <f77>   DW_AT_name        : (indirect string, offset: 0x1202e): long int
 <1><f7b>: Abbrev Number: 3 (DW_TAG_typedef)
    <f7c>   DW_AT_name        : (indirect string, offset: 0x85758): __uint32_t
    <f80>   DW_AT_decl_file   : 2
    <f81>   DW_AT_decl_line   : 79
    <f82>   DW_AT_decl_column : 25
    <f83>   DW_AT_type        : <0xf87>
 <1><f87>: Abbrev Number: 2 (DW_TAG_base_type)
    <f88>   DW_AT_byte_size   : 4
    <f89>   DW_AT_encoding    : 7	(unsigned)
    <f8a>   DW_AT_name        : (indirect string, offset: 0x4fb23): long unsigned int
 <1><f8e>: Abbrev Number: 2 (DW_TAG_base_type)
    <f8f>   DW_AT_byte_size   : 8
    <f90>   DW_AT_encoding    : 5	(signed)
    <f91>   DW_AT_name        : (indirect string, offset: 0x5f135): long long int
 <1><f95>: Abbrev Number: 2 (DW_TAG_base_type)
    <f96>   DW_AT_byte_size   : 8
    <f97>   DW_AT_encoding    : 7	(unsigned)
    <f98>   DW_AT_name        : (indirect string, offset: 0x2ba8f): long long unsigned int
 <1><f9c>: Abbrev Number: 4 (DW_TAG_base_type)
    <f9d>   DW_AT_byte_size   : 4
    <f9e>   DW_AT_encoding    : 5	(signed)
    <f9f>   DW_AT_name        : int
 <1><fa3>: Abbrev Number: 2 (DW_TAG_base_type)
    <fa4>   DW_AT_byte_size   : 4
    <fa5>   DW_AT_encoding    : 7	(unsigned)
    <fa6>   DW_AT_name        : (indirect string, offset: 0x115bb): unsigned int
 <1><faa>: Abbrev Number: 3 (DW_TAG_typedef)
    <fab>   DW_AT_name        : (indirect string, offset: 0x9916a): uint16_t
    <faf>   DW_AT_decl_file   : 3
    <fb0>   DW_AT_decl_line   : 36
    <fb1>   DW_AT_decl_column : 20
    <fb2>   DW_AT_type        : <0xf61>
 <1><fb6>: Abbrev Number: 3 (DW_TAG_typedef)
    <fb7>   DW_AT_name        : (indirect string, offset: 0x9889f): uint32_t
    <fbb>   DW_AT_decl_file   : 3
    <fbc>   DW_AT_decl_line   : 48
    <fbd>   DW_AT_decl_column : 20
    <fbe>   DW_AT_type        : <0xf7b>
 <1><fc2>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <fc3>   DW_AT_type        : <0xfb6>
 <1><fc7>: Abbrev Number: 6 (DW_TAG_array_type)
    <fc8>   DW_AT_type        : <0xfb6>
    <fcc>   DW_AT_sibling     : <0xfd7>
 <2><fd0>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <fd1>   DW_AT_type        : <0xfa3>
    <fd5>   DW_AT_upper_bound : 1
 <2><fd6>: Abbrev Number: 0
 <1><fd7>: Abbrev Number: 6 (DW_TAG_array_type)
    <fd8>   DW_AT_type        : <0xfc2>
    <fdc>   DW_AT_sibling     : <0xfe7>
 <2><fe0>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <fe1>   DW_AT_type        : <0xfa3>
    <fe5>   DW_AT_upper_bound : 1
 <2><fe6>: Abbrev Number: 0
 <1><fe7>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <fe8>   DW_AT_type        : <0xfd7>
 <1><fec>: Abbrev Number: 8 (DW_TAG_structure_type)
    <fed>   DW_AT_byte_size   : 40
    <fee>   DW_AT_decl_file   : 4
    <fef>   DW_AT_decl_line   : 458
    <ff1>   DW_AT_decl_column : 9
    <ff2>   DW_AT_sibling     : <0x1075>
 <2><ff6>: Abbrev Number: 9 (DW_TAG_member)
    <ff7>   DW_AT_name        : (indirect string, offset: 0x1898): MODER
    <ffb>   DW_AT_decl_file   : 4
    <ffc>   DW_AT_decl_line   : 460
    <ffe>   DW_AT_decl_column : 17
    <fff>   DW_AT_type        : <0xfc2>
    <1003>   DW_AT_data_member_location: 0
 <2><1004>: Abbrev Number: 9 (DW_TAG_member)
    <1005>   DW_AT_name        : (indirect string, offset: 0xa29cb): OTYPER
    <1009>   DW_AT_decl_file   : 4
    <100a>   DW_AT_decl_line   : 461
    <100c>   DW_AT_decl_column : 17
    <100d>   DW_AT_type        : <0xfc2>
    <1011>   DW_AT_data_member_location: 4
 <2><1012>: Abbrev Number: 9 (DW_TAG_member)
    <1013>   DW_AT_name        : (indirect string, offset: 0xb6a72): OSPEEDR
    <1017>   DW_AT_decl_file   : 4
    <1018>   DW_AT_decl_line   : 462
    <101a>   DW_AT_decl_column : 17
    <101b>   DW_AT_type        : <0xfc2>
    <101f>   DW_AT_data_member_location: 8
 <2><1020>: Abbrev Number: 9 (DW_TAG_member)
    <1021>   DW_AT_name        : (indirect string, offset: 0x87755): PUPDR
    <1025>   DW_AT_decl_file   : 4
    <1026>   DW_AT_decl_line   : 463
    <1028>   DW_AT_decl_column : 17
    <1029>   DW_AT_type        : <0xfc2>
    <102d>   DW_AT_data_member_location: 12
 <2><102e>: Abbrev Number: 10 (DW_TAG_member)
    <102f>   DW_AT_name        : IDR
    <1033>   DW_AT_decl_file   : 4
    <1034>   DW_AT_decl_line   : 464
    <1036>   DW_AT_decl_column : 17
    <1037>   DW_AT_type        : <0xfc2>
    <103b>   DW_AT_data_member_location: 16
 <2><103c>: Abbrev Number: 10 (DW_TAG_member)
    <103d>   DW_AT_name        : ODR
    <1041>   DW_AT_decl_file   : 4
    <1042>   DW_AT_decl_line   : 465
    <1044>   DW_AT_decl_column : 17
    <1045>   DW_AT_type        : <0xfc2>
    <1049>   DW_AT_data_member_location: 20
 <2><104a>: Abbrev Number: 9 (DW_TAG_member)
    <104b>   DW_AT_name        : (indirect string, offset: 0x2f17a): BSRR
    <104f>   DW_AT_decl_file   : 4
    <1050>   DW_AT_decl_line   : 466
    <1052>   DW_AT_decl_column : 17
    <1053>   DW_AT_type        : <0xfc2>
    <1057>   DW_AT_data_member_location: 24
 <2><1058>: Abbrev Number: 9 (DW_TAG_member)
    <1059>   DW_AT_name        : (indirect string, offset: 0xb3f94): LCKR
    <105d>   DW_AT_decl_file   : 4
    <105e>   DW_AT_decl_line   : 467
    <1060>   DW_AT_decl_column : 17
    <1061>   DW_AT_type        : <0xfc2>
    <1065>   DW_AT_data_member_location: 28
 <2><1066>: Abbrev Number: 10 (DW_TAG_member)
    <1067>   DW_AT_name        : AFR
    <106b>   DW_AT_decl_file   : 4
    <106c>   DW_AT_decl_line   : 468
    <106e>   DW_AT_decl_column : 17
    <106f>   DW_AT_type        : <0xfe7>
    <1073>   DW_AT_data_member_location: 32
 <2><1074>: Abbrev Number: 0
 <1><1075>: Abbrev Number: 11 (DW_TAG_typedef)
    <1076>   DW_AT_name        : (indirect string, offset: 0xcbc13): GPIO_TypeDef
    <107a>   DW_AT_decl_file   : 4
    <107b>   DW_AT_decl_line   : 469
    <107d>   DW_AT_decl_column : 3
    <107e>   DW_AT_type        : <0xfec>
 <1><1082>: Abbrev Number: 8 (DW_TAG_structure_type)
    <1083>   DW_AT_byte_size   : 152
    <1084>   DW_AT_decl_file   : 4
    <1085>   DW_AT_decl_line   : 550
    <1087>   DW_AT_decl_column : 9
    <1088>   DW_AT_sibling     : <0x1268>
 <2><108c>: Abbrev Number: 10 (DW_TAG_member)
    <108d>   DW_AT_name        : CR
    <1090>   DW_AT_decl_file   : 4
    <1091>   DW_AT_decl_line   : 552
    <1093>   DW_AT_decl_column : 17
    <1094>   DW_AT_type        : <0xfc2>
    <1098>   DW_AT_data_member_location: 0
 <2><1099>: Abbrev Number: 9 (DW_TAG_member)
    <109a>   DW_AT_name        : (indirect string, offset: 0xd2a75): PLLCFGR
    <109e>   DW_AT_decl_file   : 4
    <109f>   DW_AT_decl_line   : 553
    <10a1>   DW_AT_decl_column : 17
    <10a2>   DW_AT_type        : <0xfc2>
    <10a6>   DW_AT_data_member_location: 4
 <2><10a7>: Abbrev Number: 9 (DW_TAG_member)
    <10a8>   DW_AT_name        : (indirect string, offset: 0xd2aba): CFGR
    <10ac>   DW_AT_decl_file   : 4
    <10ad>   DW_AT_decl_line   : 554
    <10af>   DW_AT_decl_column : 17
    <10b0>   DW_AT_type        : <0xfc2>
    <10b4>   DW_AT_data_member_location: 8
 <2><10b5>: Abbrev Number: 10 (DW_TAG_member)
    <10b6>   DW_AT_name        : CIR
    <10ba>   DW_AT_decl_file   : 4
    <10bb>   DW_AT_decl_line   : 555
    <10bd>   DW_AT_decl_column : 17
    <10be>   DW_AT_type        : <0xfc2>
    <10c2>   DW_AT_data_member_location: 12
 <2><10c3>: Abbrev Number: 9 (DW_TAG_member)
    <10c4>   DW_AT_name        : (indirect string, offset: 0xd2a97): AHB1RSTR
    <10c8>   DW_AT_decl_file   : 4
    <10c9>   DW_AT_decl_line   : 556
    <10cb>   DW_AT_decl_column : 17
    <10cc>   DW_AT_type        : <0xfc2>
    <10d0>   DW_AT_data_member_location: 16
 <2><10d1>: Abbrev Number: 9 (DW_TAG_member)
    <10d2>   DW_AT_name        : (indirect string, offset: 0xd2a59): AHB2RSTR
    <10d6>   DW_AT_decl_file   : 4
    <10d7>   DW_AT_decl_line   : 557
    <10d9>   DW_AT_decl_column : 17
    <10da>   DW_AT_type        : <0xfc2>
    <10de>   DW_AT_data_member_location: 20
 <2><10df>: Abbrev Number: 9 (DW_TAG_member)
    <10e0>   DW_AT_name        : (indirect string, offset: 0xd29ff): AHB3RSTR
    <10e4>   DW_AT_decl_file   : 4
    <10e5>   DW_AT_decl_line   : 558
    <10e7>   DW_AT_decl_column : 17
    <10e8>   DW_AT_type        : <0xfc2>
    <10ec>   DW_AT_data_member_location: 24
 <2><10ed>: Abbrev Number: 9 (DW_TAG_member)
    <10ee>   DW_AT_name        : (indirect string, offset: 0xd2acb): RESERVED0
    <10f2>   DW_AT_decl_file   : 4
    <10f3>   DW_AT_decl_line   : 559
    <10f5>   DW_AT_decl_column : 17
    <10f6>   DW_AT_type        : <0xfb6>
    <10fa>   DW_AT_data_member_location: 28
 <2><10fb>: Abbrev Number: 9 (DW_TAG_member)
    <10fc>   DW_AT_name        : (indirect string, offset: 0xd2999): APB1RSTR
    <1100>   DW_AT_decl_file   : 4
    <1101>   DW_AT_decl_line   : 560
    <1103>   DW_AT_decl_column : 17
    <1104>   DW_AT_type        : <0xfc2>
    <1108>   DW_AT_data_member_location: 32
 <2><1109>: Abbrev Number: 9 (DW_TAG_member)
    <110a>   DW_AT_name        : (indirect string, offset: 0xd29f6): APB2RSTR
    <110e>   DW_AT_decl_file   : 4
    <110f>   DW_AT_decl_line   : 561
    <1111>   DW_AT_decl_column : 17
    <1112>   DW_AT_type        : <0xfc2>
    <1116>   DW_AT_data_member_location: 36
 <2><1117>: Abbrev Number: 9 (DW_TAG_member)
    <1118>   DW_AT_name        : (indirect string, offset: 0xd2ad5): RESERVED1
    <111c>   DW_AT_decl_file   : 4
    <111d>   DW_AT_decl_line   : 562
    <111f>   DW_AT_decl_column : 17
    <1120>   DW_AT_type        : <0xfc7>
    <1124>   DW_AT_data_member_location: 40
 <2><1125>: Abbrev Number: 9 (DW_TAG_member)
    <1126>   DW_AT_name        : (indirect string, offset: 0xd2981): AHB1ENR
    <112a>   DW_AT_decl_file   : 4
    <112b>   DW_AT_decl_line   : 563
    <112d>   DW_AT_decl_column : 17
    <112e>   DW_AT_type        : <0xfc2>
    <1132>   DW_AT_data_member_location: 48
 <2><1133>: Abbrev Number: 9 (DW_TAG_member)
    <1134>   DW_AT_name        : (indirect string, offset: 0xd29d1): AHB2ENR
    <1138>   DW_AT_decl_file   : 4
    <1139>   DW_AT_decl_line   : 564
    <113b>   DW_AT_decl_column : 17
    <113c>   DW_AT_type        : <0xfc2>
    <1140>   DW_AT_data_member_location: 52
 <2><1141>: Abbrev Number: 9 (DW_TAG_member)
    <1142>   DW_AT_name        : (indirect string, offset: 0xd2a10): AHB3ENR
    <1146>   DW_AT_decl_file   : 4
    <1147>   DW_AT_decl_line   : 565
    <1149>   DW_AT_decl_column : 17
    <114a>   DW_AT_type        : <0xfc2>
    <114e>   DW_AT_data_member_location: 56
 <2><114f>: Abbrev Number: 9 (DW_TAG_member)
    <1150>   DW_AT_name        : (indirect string, offset: 0xd2adf): RESERVED2
    <1154>   DW_AT_decl_file   : 4
    <1155>   DW_AT_decl_line   : 566
    <1157>   DW_AT_decl_column : 17
    <1158>   DW_AT_type        : <0xfb6>
    <115c>   DW_AT_data_member_location: 60
 <2><115d>: Abbrev Number: 9 (DW_TAG_member)
    <115e>   DW_AT_name        : (indirect string, offset: 0xd2a39): APB1ENR
    <1162>   DW_AT_decl_file   : 4
    <1163>   DW_AT_decl_line   : 567
    <1165>   DW_AT_decl_column : 17
    <1166>   DW_AT_type        : <0xfc2>
    <116a>   DW_AT_data_member_location: 64
 <2><116b>: Abbrev Number: 9 (DW_TAG_member)
    <116c>   DW_AT_name        : (indirect string, offset: 0xd29a2): APB2ENR
    <1170>   DW_AT_decl_file   : 4
    <1171>   DW_AT_decl_line   : 568
    <1173>   DW_AT_decl_column : 17
    <1174>   DW_AT_type        : <0xfc2>
    <1178>   DW_AT_data_member_location: 68
 <2><1179>: Abbrev Number: 9 (DW_TAG_member)
    <117a>   DW_AT_name        : (indirect string, offset: 0xd2ae9): RESERVED3
    <117e>   DW_AT_decl_file   : 4
    <117f>   DW_AT_decl_line   : 569
    <1181>   DW_AT_decl_column : 17
    <1182>   DW_AT_type        : <0xfc7>
    <1186>   DW_AT_data_member_location: 72
 <2><1187>: Abbrev Number: 9 (DW_TAG_member)
    <1188>   DW_AT_name        : (indirect string, offset: 0xd2aa0): AHB1LPENR
    <118c>   DW_AT_decl_file   : 4
    <118d>   DW_AT_decl_line   : 570
    <118f>   DW_AT_decl_column : 17
    <1190>   DW_AT_type        : <0xfc2>
